package com.stayli.app.model.domain;

import android.os.Parcel;
import android.os.Parcelable;

import com.google.gson.annotations.SerializedName;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by yhgao on 2018/2/9.
 */

public class DBBookCollection implements Parcelable {

    /**
     * count : 20
     * start : 0
     * total : 1529
     * collections : [{"status":"wish","updated":"2018-02-03 10:22:21","user_id":"1296936","book":{"rating":{"max":10,"numRaters":744,"average":"8.2","min":0},"subtitle":"","author":["张宏杰"],"pubdate":"2007-01","tags":[{"count":439,"name":"历史","title":"历史"},{"count":245,"name":"张宏杰","title":"张宏杰"},{"count":179,"name":"中国历史","title":"中国历史"},{"count":123,"name":"皇帝","title":"皇帝"},{"count":120,"name":"政治","title":"政治"},{"count":98,"name":"中国","title":"中国"},{"count":64,"name":"中国皇帝的五种命运","title":"中国皇帝的五种命运"},{"count":51,"name":"专制","title":"专制"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s10087844.jpg","binding":"16开简裝本","translator":[],"catalog":"自序\n上篇：皇冠下的五种表情\n王莽\n杨广\n朱元璋：心理咨询记录\n正德\n光绪：被\u201c帝王教育\u201d败坏的人\n下篇：皇帝制度的三个维度\n皇帝：最不幸的人\n秦始皇：历史下的蛋\n一强悍的男人\n二统一运动的最后一棒\n三专制构想的执行者\n四君主专制制度的分娩过程：战国改革运动\n先秦：专制的源头\n一寻根溯源\n二中西文化差异的第一推动力\n三王的出现\n四中国独特性的起源\n后记","pages":"304","images":{"small":"https://img3.doubanio.com/spic/s10087844.jpg","large":"https://img3.doubanio.com/lpic/s10087844.jpg","medium":"https://img3.doubanio.com/mpic/s10087844.jpg"},"alt":"https://book.douban.com/subject/1959134/","id":"1959134","publisher":"山西人民出版社","isbn10":"7203057593","isbn13":"9787203057598","title":"中国皇帝的五种命运","url":"https://api.douban.com/v2/book/1959134","alt_title":"","author_intro":"张宏杰，1972年生。蒙古族。1994年毕业于东北财经大学投资系，就职于中国建设银行。2006年调入渤海大学。中国作家协会会员，辽宁作家协会理事，辽宁文学院合同制作家。渤海大学中国文化与文学研究所副所长。著有《大明王朝的七张面孔》、《中国人比韩国人少什么》等多部作品，主要关注中国历史、文化和民族性。","summary":"本书解读了五位皇帝在皇冠压力之下的不同表情：比如王莽，阴差阳错地被\u201c人民\u201d戴上了皇冠，却因为不熟悉权力之车的性能，被中途甩下并碾死。比如杨广，机关算尽地夺取了皇冠，然后又毫无节制地榨取皇冠给他带来的快乐，终于死于权力之酒的酒精中毒症\u2026\u2026这五种表情，既可叹，又可怜。因为\u201c皇帝制度\u201d\n不仅损害着国家民众，也同时伤害着操纵这个制度的统治者。而从某种意义上来说，\u201c皇帝\u201d两个字，包含了解读中国社会的大部分密码。","price":"28.00元"},"book_id":"1959134","id":1317581943},{"status":"wish","updated":"2018-01-29 13:58:31","user_id":"1296936","book":{"rating":{"max":10,"numRaters":89,"average":"9.3","min":0},"subtitle":"","author":["梅斯特"],"pubdate":"2009-7","tags":[{"count":135,"name":"管理","title":"管理"},{"count":60,"name":"服务公司","title":"服务公司"},{"count":52,"name":"咨询","title":"咨询"},{"count":47,"name":"商业","title":"商业"},{"count":37,"name":"服务管理","title":"服务管理"},{"count":28,"name":"管理理论","title":"管理理论"},{"count":22,"name":"提升","title":"提升"},{"count":21,"name":"服务","title":"服务"}],"origin_title":"","image":"https://img1.doubanio.com/mpic/s3943977.jpg","binding":"","translator":["大龙","王文远","王静"],"catalog":"中文版序\n译者序\n前言\n第一篇 基本问题\n第1章 有关专业服务公司的一些基本问题\n第2章 专业服务公司的生命周期\n第3章 盈利：健康因素和保健因素\n第4章 解决授权不足的问题\n第二篇 关于客户\n第5章 如何制定整体的业务发展计划\n第6章 倾听客户\n第7章 工作质量高不代表服务质量高\n第8章 服务质量管理系统\n第9章 针对现有客户开展营销\n第10章 客户如何做出选择\n第11章 吸引新客户\n第12章 如何管理营销工作\n第三篇 关于人力\n第13章 关注自己的资产\n第14章 如何扩充人力资本\n第15章 缺乏动力的危机\n第16章 工作分配系统的重要性\n第17章 合伙制的含义\n第18章 如何克服人力危机的挑战\n第四篇 关于管理\n第19章 公司领导如何发挥自己的作用\n第20章 如何制定公司战略\n第21章 速成策略\n第五篇 关于合伙\n第22章 如何评估和辅导合伙人\n第23章 合伙人薪酬分配的技巧\n第24章 合伙人薪酬分配的模式\n第25章 分割馅饼\n第26章 合伙人治理\n第六篇 关于多地点\n第27章 单一公司\n第28章 \u201c猎人\u201d公司和\u201c农民\u201d公司\n第29章 做好网状系统工作\n第30章 创建合作型公司\n第31章 协调不同行业专业组\n第七篇 最后几个想法\n第32章 资产管理\n参考文献","pages":"331","images":{"small":"https://img1.doubanio.com/spic/s3943977.jpg","large":"https://img1.doubanio.com/lpic/s3943977.jpg","medium":"https://img1.doubanio.com/mpic/s3943977.jpg"},"alt":"https://book.douban.com/subject/3901835/","id":"3901835","publisher":"机械工业出版社","isbn10":"7111273702","isbn13":"9787111273707","title":"专业服务公司的管理","url":"https://api.douban.com/v2/book/3901835","alt_title":"","author_intro":"","summary":"《专业服务公司的管理》自出版以来，一直被奉为专业服务领域的管理圣经，总销量超过30万册。在欧美，它是与管理大师彼得·德鲁克、战略大师迈克尔?波特、营销大师菲利普·科特勒比肩的管理经典。专业服务公司是利用专业知识来提供服务的公司。如会计师事务所、律师事务所、咨询公司、投行、公关公司、广告公司，等等，它们与工业型公司和餐馆等服务型企业差异巨大，其面对的每个客户都各不相同，每个项目都有其独特性，其收益和分配也有自己的规则。因此，专业服务公司的管理必须特别对待。《专业服务公司的管理》的特色在于权威与实用并举。理论部分提供了专业服务公司最权威的核心管理原则，充满基于常识、一针见血的洞见；操作部分则为专业服务公司的各种管理实务提供了明确、合理的建议，如利润衡量、服务质量、业务推广、招聘、薪酬、项目组成员配比、员工发展等。此外，易为公关还特别结合中国的实际情况对中文版进行了解读，以便读者更好地运用这部经典之作。","price":"48.00元"},"book_id":"3901835","id":1314951496},{"status":"read","rating":{"max":5,"value":"3","min":0},"updated":"2018-01-21 12:49:55","user_id":"1296936","book":{"rating":{"max":10,"numRaters":56405,"average":"8.6","min":0},"subtitle":"","author":["[巴西]保罗·柯艾略"],"pubdate":"2009-3-1","tags":[{"count":9405,"name":"牧羊少年奇幻之旅","title":"牧羊少年奇幻之旅"},{"count":7499,"name":"保罗柯艾略","title":"保罗柯艾略"},{"count":6717,"name":"外国文学","title":"外国文学"},{"count":5924,"name":"小说","title":"小说"},{"count":4416,"name":"与心沟通","title":"与心沟通"},{"count":3938,"name":"巴西","title":"巴西"},{"count":3855,"name":"童话","title":"童话"},{"count":2574,"name":"拉美","title":"拉美"}],"origin_title":"O Alquimista","image":"https://img1.doubanio.com/mpic/s3668327.jpg","binding":"精装","translator":["丁文林"],"catalog":"自序\n引子\n上部\n下部\n尾声","ebook_url":"https://read.douban.com/ebook/9859707/","pages":"217","images":{"small":"https://img1.doubanio.com/spic/s3668327.jpg","large":"https://img1.doubanio.com/lpic/s3668327.jpg","medium":"https://img1.doubanio.com/mpic/s3668327.jpg"},"alt":"https://book.douban.com/subject/3608208/","id":"3608208","publisher":"南海出版公司","isbn10":"7544244199","isbn13":"9787544244190","title":"牧羊少年奇幻之旅","url":"https://api.douban.com/v2/book/3608208","alt_title":"O Alquimista","author_intro":"保罗·柯艾略著名作家，1947出生于巴西里约热内卢，被誉为\u201c上帝身边的伟大作家\u201d。少年时代，因叛逆，被视为精神疾病受到三次电击治疗；青年时代，因反对政治独裁，被投进监狱；1986年，38岁的他踏上去往圣城圣地亚哥之路，心灵顿悟。\n从1987年的《朝圣》开始，18部作品以68种文字出版、655个版本全球在160多个国家和地区出版发行，销售总量超过1亿册，荣获国际大奖无数，被誉为\u201c唯一能够与马尔克斯比肩，拥有最多读者的拉美作家\u201d。\n柯艾略以博大悲悯的心胸、奇绝独特的视角、清澈如水的文字，将哲学沉思、宗教奇迹、童话寓言熔为一体，感动了全球上至各国政要、国际巨星，下至平民百姓、贩夫走卒在内的数以亿计的读者，甚至目不识丁的人，也对他的文字世界无限神往。2007年，由于其作品的深远影响力，联合国聘请他为联合国和平大使。","summary":"牧羊少年圣地亚哥接连两次做了同一个梦，梦见埃及金字塔附近藏有一批宝藏。少年卖掉羊群，历尽千辛万苦一路向南，跨海来到非洲，穿越\u201c死亡之海\u201d撒哈拉大沙漠\u2026\u2026期间奇遇不断，在一位炼金术士的指引下，他终于到达金字塔前，悟出了宝藏的真正所在\u2026\u2026","ebook_price":"11.99","series":{"id":"4806","title":"新经典文库·保罗·柯艾略作品"},"price":"25.00元"},"book_id":"3608208","id":1310238810},{"status":"wish","updated":"2018-01-14 20:12:07","user_id":"1296936","book":{"rating":{"max":10,"numRaters":224,"average":"8.5","min":0},"subtitle":"","author":["李荷西"],"pubdate":"2017-11-30","tags":[{"count":185,"name":"爱情","title":"爱情"},{"count":173,"name":"青春","title":"青春"},{"count":128,"name":"青春，爱情","title":"青春，爱情"},{"count":112,"name":"爱情的模样","title":"爱情的模样"},{"count":105,"name":"文学","title":"文学"},{"count":94,"name":"小说","title":"小说"},{"count":65,"name":"恋爱","title":"恋爱"},{"count":47,"name":"五个星！！！！！！！！","title":"五个星！！！！！！！！"}],"origin_title":"","image":"https://img1.doubanio.com/mpic/s29617329.jpg","binding":"平装","translator":[],"catalog":"楔子\n第一章\n假如有一天，我们回去了\n第二章\n斯人若彩虹，遇上方知有\n第三章\n初见的隐痛\n第四章\n我原谅所有的缺席和变故\n第五章\n心不动，则不痛\n第六章\n无风无自更生漪\n第七章\n我的错都是父母的错\n第八章\n夏风十里，不如你\n第九章\n告别的意义\n第十章\n岁月是个撕书人\n第十一章\n青春是零钱买啤酒，换一场醉\n第十二章\n我听见盛夏全部的虫鸣\n第十三章\n喜欢，像做贼\n第十四章\n七月悲喜交加\n第十五章\n喜欢一个人需要理由吗\n第十六章\n夜吻\n第十七章\n异地恋红多了眼\n第十八章\n如果这不是爱情，那么什么是\n第十九章\n其实只恋长安某\n第二十章\n没道理的爱情\n第二十一章\n吃了一朵过敏的花\n第二十二章\n惶恐与快乐都秘而不宣\n第二十三章\n爱的水洗和打磨\n第二十四章\n仲夏夜之梦\n第二十五章\n我们都必须经过客西马尼园和各各他山\n第二十六章\n先提出分手的那个人，以为自己做了最正确的决定\n第二十七章\n下坠\n第二十八章\n我什么都没忘，只是选择了收藏\n第二十九章\n时间不是药，药在时间里\n第三十章\n我怕永不相见，也怕再次重逢\n第三十一章\n你曾温柔呼唤，而我恰有应答\n第三十二章\n没有青春不散场\n第三十三章\n有生之年，狭路遇见\n第三十四章\n爱人的窄门\n第三十五章\n猜心\n第三十六章\n我拥有的都是侥幸\n第三十七章\n同奏\n第三十八章\n若你专制，我便依顺\n第三十九章\n在冬天里寻找夏天的人\n第四十章\n珍若拱璧的余威与灰烬\n第四十一章\n爱里的一千零一面镜子\n第四十二章\n我们唯一能够逃避的就是逃避本身\n第四十三章\n所求亦是所需\n尾声\n番外  陈尽欢\n一切都是偶然，一切都是注定。","pages":"344","images":{"small":"https://img1.doubanio.com/spic/s29617329.jpg","large":"https://img1.doubanio.com/lpic/s29617329.jpg","medium":"https://img1.doubanio.com/mpic/s29617329.jpg"},"alt":"https://book.douban.com/subject/27205557/","id":"27205557","publisher":"湖南文艺出版社","isbn10":"7540461047","isbn13":"9787540461041","title":"没道理的爱情","url":"https://api.douban.com/v2/book/27205557","alt_title":"","author_intro":"李荷西\n作家，编剧，豆瓣人气作者。\n阅读是对生命的按图索骥，\n写作是勾画梦境的山河。","summary":"遥远而明媚的青春年华里，莽撞而羞涩的少女佳慧隐藏起说不出口的爱意，来呵护更觉珍贵的友情，并恪守了一个学生的本分。直到高考结束，才正视自己压抑太久的初恋，并勇敢地和两情相悦的袁毅走在了一起。\n异地恋令两人痛苦，更因为身边有了另一个人的出现，让两人的爱情出现了裂缝。后来因为一场人为的误会，佳慧和袁毅在深爱彼此的时候，选择了分手。分手后的佳慧认真地过完了自己的大学生活，开始工作。在以为自己终于习惯了一个人的生活，并且可以忘记那段刻骨铭心的恋情时，却在偶然间又与袁毅相遇\u2026\u2026","price":"34.80元"},"book_id":"27205557","id":1306225517},{"status":"read","rating":{"max":5,"value":"3","min":0},"updated":"2017-11-16 15:21:09","user_id":"1296936","book":{"rating":{"max":10,"numRaters":257,"average":"7.4","min":0},"subtitle":"","author":["孙中伦"],"pubdate":"2017-6-1","tags":[{"count":68,"name":"孙中伦","title":"孙中伦"},{"count":63,"name":"理想国","title":"理想国"},{"count":58,"name":"纪实","title":"纪实"},{"count":57,"name":"非虚构","title":"非虚构"},{"count":35,"name":"文学","title":"文学"},{"count":35,"name":"中国","title":"中国"},{"count":27,"name":"2017","title":"2017"},{"count":21,"name":"当代中国","title":"当代中国"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s29471436.jpg","binding":"平装","translator":[],"catalog":"001  Letter 1\n005  回去\n015  Letter 2\n019  东莞日记\n079  Letter 3\n083  人民街\n095  Letter 4\n099  定西孩子\n147  Letter 5\n151  单读是谁\n183  四月三月\n205  Letter 6\n209  成都漆器厂\n263  Letter 7\n265  Reply 回来","ebook_url":"https://read.douban.com/ebook/35846168/","pages":"311","images":{"small":"https://img3.doubanio.com/spic/s29471436.jpg","large":"https://img3.doubanio.com/lpic/s29471436.jpg","medium":"https://img3.doubanio.com/mpic/s29471436.jpg"},"alt":"https://book.douban.com/subject/27065663/","id":"27065663","publisher":"理想国 | 台海出版社","isbn10":"7516814059","isbn13":"9787516814055","title":"回来","url":"https://api.douban.com/v2/book/27065663","alt_title":"","author_intro":"孙中伦，生于1994年，美国波莫纳学院（Pomona College）学生，主修PPE（政治经济哲学）和德语专业，罗德奖学金最终候选人，入选剑桥大学2017年社会人类学硕士项目。","summary":"1、\t一次\u201c寻路中国\u201d式的现实探索\u2014\u2014作者孙中伦毕业于美国波莫纳学院，罗德奖学金最终候选人。2015年，大三结束的他突然决定休学一年，回国打工，成为了东莞工厂的流水线工人，大理民宿的店小二，甘肃定西的初中老师，成都漆器厂的学徒工，北京某网站的新媒体编辑\u2026\u2026他将这一路的所见所闻记录下来，完成了一次何伟\u201c寻路中国\u201d式的观察和探索。\n2、\t一个年轻人眼中的历史和社会\u2014\u2014对历史与社会的阐释往往湮没在宏大叙事和精英话语中，这本书记录的是一个年轻人对外部世界的探寻、对社会历史的思考，这里有形形色色的小人物：胡哥四处借款只为开一家奶茶店、河水吞噬了暖娟两岁零一个月的女儿、年纪轻轻却异常沉稳的庚壬是人人敬佩的\u201c许领班\u201d、王姐带着小女儿探望狱中的弟弟，天真的孩子仰头问道：舅舅为什么在玻璃里面\u2026\u2026\n3、\t一段寻找自我的漫漫征程\u2014\u2014\u201c我会做一个自己想做的人，可我并不知道那是谁\u201d，带着这个最初的疑问，作者将自身的青春迷惘和价值困惑融入旅途见闻，通过最切身的体验，得出了青涩感性又非同一般的省思。终于，在他人的故事里，他释然了亲人的逝去、抚慰了青春的伤痛、了然了自我的追求。没有人是一座孤岛，在别人的故事里，我们看到自己，我们与世界和解。\n《回来》是一部非虚构作品，也是作者孙中伦的处女作，记录了他休学一年、回国打工的经历与所思。\n2015年夏天，21岁的孙中伦大三结束，他决定中断学业，从美国波莫纳学院休学一年，回中国打工。他去到东莞、大理、定西、苏州、北京、成都，做过流水线工人、民宿招待、初中老师、新媒体编辑、寺庙居士、漆器厂学徒，一边流浪一边工作。\n在东莞的流水线上，他追问工人们的生活与理想；在大理的民宿中，他遇见不得志的诗人；在北京的编辑室里，他对青春的痛与梦有了深切的感悟；在成都的漆器厂里，他理解了坚守和匠人的意义；在定西的孩子、父母和老师们中间，他重新认识了生命的真谛、贫穷的代价，以及人与人之间难能可贵的相遇和相知\u2026\u2026\n除了这一年的经历，他在给未能出生的胞兄的七封信中，写下了一个青年人对生活的困惑、对世界的求知和对自我的质疑，青春的迷茫、张扬和省思，在字里行间娓娓道来。而在想象中的胞兄的七封回信里，他似乎终于完成了一场与自己、与家人、与世界的短暂和解。","ebook_price":"19.50","price":"39.00元"},"book_id":"27065663","id":1270913031},{"status":"read","rating":{"max":5,"value":"4","min":0},"updated":"2017-11-12 18:53:02","user_id":"1296936","book":{"rating":{"max":10,"numRaters":3815,"average":"7.2","min":0},"subtitle":"新鲜有趣的话术精进技巧","author":["马东","马薇薇","黄执中","周玄毅","邱晨","胡渐彪","刘京京"],"pubdate":"2017-1-10","tags":[{"count":1821,"name":"说话技巧","title":"说话技巧"},{"count":1498,"name":"沟通","title":"沟通"},{"count":1139,"name":"好好说话","title":"好好说话"},{"count":895,"name":"奇葩说","title":"奇葩说"},{"count":716,"name":"我想读这本书","title":"我想读这本书"},{"count":673,"name":"个人管理","title":"个人管理"},{"count":575,"name":"马东","title":"马东"},{"count":508,"name":"好书，值得一读","title":"好书，值得一读"}],"origin_title":"","image":"https://img1.doubanio.com/mpic/s29278678.jpg","binding":"精装","translator":[],"catalog":"推荐序\n好好说话这事儿有多重要 / 樊 登\n说话是个\u201c技术活\u201d/ 李笑来\n自序\n好好说话，其实是好好思考\n引言\n这个时代要怎样好好说话\n第一章 五维话术：在任何场景好好说话\n说话，是一项综合能力。当我们将一种能力发挥到极致的时候，自然就会感觉到它需要进一步的别的能力的补充，达到五维俱全的圆融状态，才能使我们在任何场景下都能成为一个好好说话的人。\n说话之伤都是暗伤\n说话的底气来自实力\n每句话，都是权力的游戏\n话术能力是全息的\n第二章 沟通：将双方置于同一平面\n人与人之间本是不相连的个体。唯有通过沟通，我们内心的认知才能有机会摆在同一个层面。因此，沟通不只是一般人眼中的说话技巧，更是一种帮助你打破自身局限、在交流中实现自我，并且进一步帮助他人自我实现的技能。\n承上启下的工具性沟通\n冲突时不要寻求结论与解答\n承认自身情绪，引导他人情绪\n通过自我沟通把弱点当成铠甲\n第三章 说服：将观点植入对方心中\n一切的说服都只是为了找到一个切入点，好让对方能从中为自己找出一个去做的理由。所以，当我们要说服别人的时候，第一步就是要意识到，每个人都必须拥有对自己行为的选择权，确保它，并且善用它。\n用选择权启发对方\n诉诸需求触及对方痛点\n创造压力改变双方立场\n第四章 谈判：把冲突变成合作\n首先，谈判起于僵局，且必然发生于\u201c不可忍受的僵局\u201d。其次，谈判的本质就是交换，且主要交换的乃是双方评价不相同的事物。为彼此创造出各种评价不同的事物以供协商与交换，则是所有谈判的精髓所在。\n搜集情报的便捷方式\n突破惯性思维进行出价\n在让步中谈成交易\n陷入僵局时不如搁置\n第五章 演讲：靠语言的力量赢得观众的好感\n在五维话术体系中，演讲是形式最简单，也最能明显体现一个人是否会说话的一项。因为虽然人人都会说话，却很少有人敢于、善于对众人说话，做到自信、流畅、清晰、生动地表述。\n别紧张，没人在意你的尴尬\n照顾到多方面的微妙关系\n听众的信任决定演讲的成败\n自信与表达的自我训练\n第六章 辩论：通过对抗争取第三方支持\n对于普通人而言，辩论训练对于提升反应力、洞察力和大局观很有帮助。而在这个充斥着忽悠和不靠谱的世界里，辩论思维也是一种必要的\u201c心智防身术\u201d。\n准确地意识到对方存在的问题\n辩论的核心能力是反驳\n借力打力，以退为进","ebook_url":"https://read.douban.com/ebook/30661864/","pages":"296","images":{"small":"https://img1.doubanio.com/spic/s29278678.jpg","large":"https://img1.doubanio.com/lpic/s29278678.jpg","medium":"https://img1.doubanio.com/mpic/s29278678.jpg"},"alt":"https://book.douban.com/subject/26948148/","id":"26948148","publisher":"中信出版社","isbn10":"7508671503","isbn13":"9787508671505","title":"好好说话","url":"https://api.douban.com/v2/book/26948148","alt_title":"","author_intro":"主创成员：马东、马薇薇、黄执中、周玄毅、邱晨、胡渐彪、刘京京。\n《奇葩说》缔造者，三季冠军及幕后导师团队，华语圈最会说话的组合。\n马东，新晋商业明星 前央视著名主持人，曾任爱奇艺首席内容官，2016年《第一财经周刊》年度经济人物，《奇葩说》主持人。\n马薇薇，金句女王 第一季《奇葩说》冠军，金句频出、观点犀利，被誉为独立知识女性的新锐代表。\n邱晨 第二季《奇葩说》冠军\n黄执中 第三季《奇葩说》冠军","summary":"一直以来，我们以\u201c听话\u201d的方式被教育，却又以\u201c说话\u201d的方式被考核，这很尴尬。我们所学的东西无不以\u201c表达\u201d为指向，他人对我们的看法也几乎都以\u201c表达\u201d为依据，可是作为最直接表达方式的\u201c说话\u201d，却始终处于极其边缘的地位，这也很尴尬。\n尴尬之所在，正是机会所在。况且，在成功所需要的一切因素里，相较于出身、机遇、精力、智力、意志品质，我们最能控制的，其实就是\u201c说话\u201d这件小事。那么多年轻人被《好好说话》吸引，这本身就是明证。\n现代社会高度竞争的复杂人际关系，快节奏的学习和工作环境，要求我们有更加智慧、更有锐气、更强调科学性与可操作性的\u201c好好说话\u201d之道 。\n所以，《好好说话：新鲜有趣的话术精进技巧》抛开常见的教授套路，通过新鲜、有趣的说话技巧，达到修正读者三观，激发读者思维，传输使用技巧，综合提升说话之道。\n媒体评论\n我们和大家一样，都是走在好好说话的路上。这本书里提到的很多误区，可能会以任何一种形式发生在任何一个人身上。敬请对号入座，我们一起成长。\n\u2014\u2014马东  米未传媒创始人兼CEO，《奇葩说》议长，前爱奇艺首席内容官\n所有的话，鼓励也好、指责也罢，其实都是在表达说话者的需求与渴望。在校园、在社会，实现表达者的这些目的，都需要一定的技巧。而有趣、有料的人际交往类图书不多，所以我推荐大家看看这本套路奇袭、生猛有料的《好好说话》。\n\u2014\u2014罗振宇  罗辑思维创始人\n因为马老师的写实落地的风格，他们想解决的问题都还挺\u201c俗\u201d的：怎么谈判，怎么搭讪，怎么把坏人噎回去，怎么夸人\u2026\u2026哪一个不是你经常捶胸顿足，觉得自己拙嘴笨腮的场景？这种场景化的写作，既可以当工具书看，也可以当章回小说消遣。以他们奇葩般的表达能力，保证你拿起来就不想放下。\n\u2014\u2014樊登  樊登读书会创始人\n马老师的这本《好好说话》以他一贯的新鲜、有趣的方式传授了说话的核心技巧，一口气读完，感觉很过瘾。我觉得说话技能的修炼，学无止境。我自己也知道自己什么德行，知道自己不是进步太大了，而是岁数大了、环境变了，没那么多机会让自己出丑而已，在\u201c会说话\u201d，尤其是\u201c得体地与人沟通\u201d这事儿上，必须要活到老学到老，并且还要练到老。\n\u2014\u2014李笑来  著名天使投资人，连续创业者，终生学习者","ebook_price":"26.99","price":"49.00元"},"book_id":"26948148","id":1270176317},{"status":"wish","updated":"2017-10-04 14:29:52","user_id":"1296936","book":{"rating":{"max":10,"numRaters":14009,"average":"8.1","min":0},"subtitle":"","author":["严歌苓"],"pubdate":"2017-4-1","tags":[{"count":4565,"name":"严歌苓","title":"严歌苓"},{"count":2277,"name":"芳华","title":"芳华"},{"count":2068,"name":"小说","title":"小说"},{"count":1616,"name":"那个年代","title":"那个年代"},{"count":1358,"name":"中国现当代文学","title":"中国现当代文学"},{"count":1322,"name":"文学","title":"文学"},{"count":1267,"name":"文工团","title":"文工团"},{"count":1004,"name":"中国","title":"中国"}],"origin_title":"你触摸了我","image":"https://img3.doubanio.com/mpic/s29418322.jpg","binding":"平装","translator":[],"catalog":"","pages":"215","images":{"small":"https://img3.doubanio.com/spic/s29418322.jpg","large":"https://img3.doubanio.com/lpic/s29418322.jpg","medium":"https://img3.doubanio.com/mpic/s29418322.jpg"},"alt":"https://book.douban.com/subject/27010212/","id":"27010212","publisher":"人民文学出版社","isbn10":"7020123724","isbn13":"9787020123728","title":"芳华","url":"https://api.douban.com/v2/book/27010212","alt_title":"你触摸了我","author_intro":"严歌苓  小说家，电影编剧。1986年出版第一本长篇小说，同年加入中国作家协会。1989年赴美留学，获艺术硕士学位。旅美期间获得十多项美国及台湾、香港地区的文学奖，并获台湾电影金马奖*编剧奖、美国影评家协会奖。2001年加入美国电影编剧协会。代表作有《扶桑》《第九个寡妇》《小姨多鹤》《陆犯焉识》《妈阁是座城》及用英文写作的《赴宴者》等。作品已被翻译成十几种语言出版。","summary":"从军经历伴随了严歌苓整个的青春年华。当她后来成为了一个作家，这段经历成了她取之不竭的创作源泉。《一个女兵的悄悄话》《雌性的草地》《灰舞鞋》《白麻雀》《爱犬颗勒》，都以部队生活为题材，但多是以一个作家的客观视角来为那个时代的军人塑像。而她*创作的长篇小说《芳华》则具有浓厚的个人自传色彩，是以*人称描写她当年亲历的部队文工团生活：隐藏在西南部都城的一座旧红楼里、某部队文工团的内景中发生的军版\u201c才子佳人\u201d的故事。\n《芳华》涵盖了严歌苓的青春与成长期，她在四十余年后回望这段经历，笔端蕴含了饱满的情感。青春荷尔蒙冲动下的少男少女的懵懂激情，由激情犯下的过错，由过错生出的懊悔，还有那个特殊的时代背景，种种，构成了《芳华》对一段历史、一群人以及潮流更替、境遇变迁的复杂感怀。今天的作者严歌苓与当时的小女兵萧穗子在作品里构成了理性与感性的对话关系，重新呈现了当时年代里青春的混沌、感性与蒙昧。生命的恣肆与人性的层次以及时代的的特征构成了《芳华》繁复的调性，它向读者打开了多层面的认识路径。","series":{"id":"38126","title":"严歌苓作品在人文社"},"price":"39.00元"},"book_id":"27010212","id":1251542358},{"status":"wish","updated":"2017-10-04 14:16:00","user_id":"1296936","book":{"rating":{"max":10,"numRaters":159058,"average":"8.8","min":0},"subtitle":"\u201c地球往事\u201d三部曲之一","author":["刘慈欣"],"pubdate":"2008-1","tags":[{"count":45258,"name":"科幻","title":"科幻"},{"count":35449,"name":"刘慈欣","title":"刘慈欣"},{"count":23951,"name":"三体","title":"三体"},{"count":18350,"name":"科幻小说","title":"科幻小说"},{"count":15056,"name":"中国","title":"中国"},{"count":13621,"name":"小说","title":"小说"},{"count":12214,"name":"硬科幻","title":"硬科幻"},{"count":11994,"name":"中国科幻","title":"中国科幻"}],"origin_title":"","image":"https://img1.doubanio.com/mpic/s2768378.jpg","binding":"平装","translator":[],"catalog":"1.科学边界\n2.台球\n3.射手和农场主\n4.三体、周文王、长夜\n5.叶文洁\n6.宇宙闪烁之一\n7.疯狂年代\n8.寂静的春天\n9.红岸之一\n10.宇宙闪烁之二\n11.大史\n12.三体、墨子、烈焰\n13.红岸之二\n14.红岸之三\n15.红岸之四\n16.三体、哥白尼、宇宙橄榄球、三日凌空\n17.三体问题\n18.三体、牛顿、冯·诺伊曼、秦始皇、三日连珠\n19.聚会\n20.三体、爱因斯坦、单摆、大撕裂\n21.三体、远征\n22.地球叛军\n23.红岸之五\n24.红岸之六\n25.叛乱\n26.雷志成、杨卫宁之死\n27.无人忏悔\n28.伊文斯\n29.第二红岸基地\n30.地球三体运动\n31.两个质子\n32.古筝行动\n33.监听员\n34.智子\n35.虫子\n36.尾声·遗址\n后记","ebook_url":"https://read.douban.com/ebook/930946/","pages":"302","images":{"small":"https://img1.doubanio.com/spic/s2768378.jpg","large":"https://img1.doubanio.com/lpic/s2768378.jpg","medium":"https://img1.doubanio.com/mpic/s2768378.jpg"},"alt":"https://book.douban.com/subject/2567698/","id":"2567698","publisher":"重庆出版社","isbn10":"7536692935","isbn13":"9787536692930","title":"三体","url":"https://api.douban.com/v2/book/2567698","alt_title":"","author_intro":"刘慈欣，祖籍河南，长于山西，中国科普作家协会会员，山西省作家协会会员，高级工程师。\n自1999年处女作《鲸歌》问世以来，刘慈欣已发表短篇科幻小说三十余篇、出版长篇科幻小说六部，并创下连续八年荣获中国科幻最高奖\u201c银河奖\u201d的纪录。他的长篇作品《三体》开创《科幻世界》月刊连载原创作品的先例，成为2006年度最受关注、最畅销的科幻小说。","summary":"文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划\u201c红岸工程\u201d取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰\u2026\u2026\n四光年外，\u201c三体文明\u201d正苦苦挣扎\u2014\u2014三颗无规则运行的太阳主导下的百余次毁灭与重生逼迫他们逃离母星。而恰在此时。他们接收到了地球发来的信息。在运用超技术锁死地球人的基础科学之后。三体人庞大的宇宙舰队开始向地球进发\u2026\u2026\n人类的末日悄然来临。","ebook_price":"6.00","series":{"id":"38","title":"科幻世界·中国科幻基石丛书"},"price":"23.00"},"book_id":"2567698","id":1251536627},{"status":"wish","updated":"2017-07-29 14:59:42","user_id":"1296936","book":{"rating":{"max":10,"numRaters":322,"average":"6.5","min":0},"subtitle":"","author":["横田真由子"],"pubdate":"2016-12","tags":[{"count":60,"name":"时尚","title":"时尚"},{"count":60,"name":"个人管理","title":"个人管理"},{"count":53,"name":"日本","title":"日本"},{"count":50,"name":"女性","title":"女性"},{"count":44,"name":"生活","title":"生活"},{"count":43,"name":"聪明女人背小包","title":"聪明女人背小包"},{"count":32,"name":"我想读这本书","title":"我想读这本书"},{"count":29,"name":"美容·化妆·服饰","title":"美容·化妆·服饰"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s29200943.jpg","binding":"平装","translator":["蔡明明"],"catalog":"前言\n丰富的人生，从小包开始_001\nChapter1少而精的观点\n1  物尽其用的态度\n2  从祖母传承给孙女的传说之包\n3  10,000日元的包包买10个，是你吗？\n4  外出购物要盛装\n5  推荐你去名品店\u201c试穿\u201d的理由\n6  去尝试最高端和最低端的\n7  女人购物做除法，男人购物做乘法\n8  为什么我不穿高领\n9  一直选黑色的话难度很高\n10  如何聪明地使用经典款和流行款\n11  一直看起来都像是穿着同样的衣服是很潮的\n12  在餐厅点菜的能力_\nColumn 1 买套装就去品牌折扣店\nColumn 2 快走的鞋子去ZARA买\nChapter2钱怎么花在刀刃上\u2014精选 10 件商品\n1 鞋子\u2014\u2014脚下如磐石，人生磐石\n2 手表\u2014\u2014为你铭刻重要的时间\n3 短外套\u2014\u2014包包和短外套的风格要统一\n4 名片夹\u2014\u2014比\u201c名片\u201d更代表你\n5 发夹\u2014\u2014让背影看起来也很美好\n6 圆珠笔\u2014\u2014\u2014想要显得专业，就不要用100日元的圆珠笔\n7 丝绸\u2014\u2014无论冬夏都能出彩的精品\n8 梳子\u2014\u2014头发的秀美全靠它\n9 化妆刷\u2014\u2014廉价化妆品的妙手回春大法\n10 大衣\u2014\u2014若搭配得好，气质非凡\nColumn 3 毛巾带来额外的满足\nChapter3 优雅与美感的修炼之法\n1  如要优雅请专心\n2  到70岁还坚持修脚\n3  任何时候穿着得体\n4  最常用的地方保持最整洁\n5  光芒闪耀的人会保养好自己的两副皮囊\n6  上美发店不是消费而是投资\n7  健美的腓肠肌是行动力之源\n8  两条胳膊就是第二张脸\n9  为何年轻的巴黎姑娘不用香奈儿\n10  未来会为你创造真正的心仪之物_\nColumn 4 化妆包要一年一换\nChapter4 用小包的生活方式\n1  \u201c小包\u201d象征着你有限而珍贵的人生\n2  重要的决定遵从直觉的选择\n3  根据人生舞台而变化的包包\n4  养花以后明白的道理\n5  会修补东西的人，就会修补人际关系","ebook_url":"https://read.douban.com/ebook/31255165/","pages":"240","images":{"small":"https://img3.doubanio.com/spic/s29200943.jpg","large":"https://img3.doubanio.com/lpic/s29200943.jpg","medium":"https://img3.doubanio.com/mpic/s29200943.jpg"},"alt":"https://book.douban.com/subject/26929201/","id":"26929201","publisher":"湖南文艺出版社","isbn10":"7540478772","isbn13":"9787540478773","title":"聪明女人背小包","url":"https://api.douban.com/v2/book/26929201","alt_title":"","author_intro":"横田真由子\n在株式会社开云日本（旧古驰日本）任职期间，作为销售员专门负责知名人士及VIP顾客，3年内升任店长。获得顾客数量No.1。在为VIP顾客挑选商品的过程中，逐渐学会作为女性的优雅的生活方式，并积极实践其自身创造的\u201c成熟女性的优雅\u201d。2004年起以研修讲师独立。作为一名职业咨询师，积极致力于帮助女性实现职业计划，顾客回头率高达97%。译者：蔡明明，女，籍贯广东，日语高级翻译。受教于\u201c深圳日语同传第一人\u201d刘金权。真人在线实时翻译APP翻易家认证。现500强日企女白领。主攻国际贸易，医药及咨询行业等的中日笔译和口译。","summary":"想轻装出门吗？只要试试改背小包，便会让你顿显优雅高贵的气质。带着小包，你可以轻轻松松出门，可以离开每天走过的一成不变的路，走不同的地方看看。会让您拥有积极向上的好奇心。视野拓宽了，您便能够找到许多美好的事物。例如，无意邂逅一位一直想见到的人，这样的好运也往往只会找到比平 时靓丽的人。那些总是美丽而温柔的人，往往都只有几件特别上品的随身物品。生活在自己钟爱的物品中，如果一个人能够获得这样的生活，自然会拥有高贵大度的气质。最重要的，就是要找到对自己来说什么是最重要的，这是一种能力。你不再需要\u201c不停地丢弃\u201d东西。","ebook_price":"10.99","price":"39.80元"},"book_id":"26929201","id":1221714642},{"status":"read","rating":{"max":5,"value":"4","min":0},"updated":"2017-03-02 16:15:32","user_id":"1296936","tags":["职场","公关"],"book":{"rating":{"max":10,"numRaters":193,"average":"8.1","min":0},"subtitle":"","author":["曹樱乔"],"pubdate":"2015-11","tags":[{"count":62,"name":"职场","title":"职场"},{"count":58,"name":"职场小说","title":"职场小说"},{"count":46,"name":"我想读这本书","title":"我想读这本书"},{"count":40,"name":"公关","title":"公关"},{"count":34,"name":"女性励志","title":"女性励志"},{"count":32,"name":"好书，值得一读","title":"好书，值得一读"},{"count":14,"name":"曹樱乔","title":"曹樱乔"},{"count":13,"name":"想读中。。。","title":"想读中。。。"}],"origin_title":"Running in high heels","image":"https://img1.doubanio.com/mpic/s28344159.jpg","binding":"平装","translator":[],"catalog":"试飞记 |公关菜鸟的第一根羽毛  001\n被\u201c主动辞职\u201d的丑小鸭  002\n与新老板一起吃午餐  010\n关于一杯绿茶的奇遇  018\n逆风展翅，一飞升天  029\nCarrie，你想飞多远？  038\n鲸鱼记 |Team Leader 的自我成长  043\n赢了\u201c战役\u201d丢了\u201c兵\u201d  044\n那些沿途错失的美景  054\n跳吧，小鲸鱼们！  060\n制衡记 |总有机会让你扳回一局  067\n过河卒子的反击  068\n树欲静，风不止  076\n生气不如争气！  082\n同盟记 |让团队成功，自己才能成功  089\n挽起袖子，把手弄脏  090\n这个问题真的没办法解决了吗？  096\n换位思考  105\n狸猫记 |要做最懂媒体的公关人  111\nKelly 的秘密拜访行动  112\n一次跌宕起伏的撤稿  121\n从一开始就是个套儿  132\n暗箱记 |学会建立全新的客户关系  135\n天下没有免费的午餐  136\n向高人取经！  140\n机会从天而降  146\n一双翻云覆雨手  150\n你要学会自我保护  155\n淬火记 |经济危机是一场漫长的战役  157\n风云突变  158\n不华丽的转身  168\n未生之局  176\n不要问为什么  180\n夹缝求生  182\n以人为先  189\n焚心记 |优秀与卓越的差别只有 5%  197\n初遇黑马王子  198\n汽车是他的 Baby  205\n有爱的孩子  210\n有多少爱禁得起等待？  215\n圆舞记 |当好临时的新闻发言人  219\n一个人的舞蹈  220\n如此惊喜！  224\n临危受命  228\n危机 = 危险 + 机会  236\n草根记 |转战社会化媒体公关  239\n再领军令状  240\n是李逵还是李鬼  251\n化敌为友  262\n夜航记 |事业与爱情的双赢  269\n虚拟的爱情  270\n硬币的两面  277\n人生的万花筒  287","pages":"296","images":{"small":"https://img1.doubanio.com/spic/s28344159.jpg","large":"https://img1.doubanio.com/lpic/s28344159.jpg","medium":"https://img1.doubanio.com/mpic/s28344159.jpg"},"alt":"https://book.douban.com/subject/26665530/","id":"26665530","publisher":"鹭江出版社","isbn10":"7545910427","isbn13":"9787545910421","title":"穿着高跟鞋奔跑","url":"https://api.douban.com/v2/book/26665530","alt_title":"Running in high heels","author_intro":"作者曹樱乔女士拥有超过十年的专业公关顾问经验，曾担任易为公关合伙人、北京总经理，明思力中国企业传播与政府事务总经理。曹女士拥有广泛的产品及企业品牌公关经验，涉及IT、快速消费品、连锁经营、政府机构及非营利组织、B2B、能源、医药等多个行业领域；为数十家跨国企业及财富五百强企业提供品牌定位、公关战略规划、媒体关系管理、危机管理、新闻发言人培训等顾问服务。","summary":"本书是一本职场小说，描写了一位外企公关行业的菜鸟，从初入职场的懵懂无知到能够独当一面的成长过程。\n公关，一个小众却被大众误解的行业；一个脑力、精力、心力、体力、美丽密集的行业一个女性比例高达70%以上，只有女王和女汉子才能生存的战场；一个可以很俗也可以很雅的舞台\u2026\u2026小说展现主人公跌宕起伏的职场经历，具有外企公关行业的特色，故事曲折生动，节奏时尚明快、人物温暖励志、内涵积极向上，适合大多数职场女性阅读。\n本书作者具有多年的公关行业从业经验，因而书中也有很多对职场女性有所启迪的内容，此外，还特别附赠随身小册子，介绍作者从业十二年来的一些经验，颇具实用性。","price":"38.00元"},"book_id":"26665530","id":1150418577},{"status":"wish","updated":"2017-02-11 01:00:37","user_id":"1296936","book":{"rating":{"max":10,"numRaters":25,"average":"7.1","min":0},"subtitle":"职场公关进阶实录","author":["子非","瑜玥"],"pubdate":"2010-5","tags":[{"count":12,"name":"职场小说","title":"职场小说"},{"count":7,"name":"水泥座女人","title":"水泥座女人"},{"count":6,"name":"公关","title":"公关"},{"count":5,"name":"房地产","title":"房地产"},{"count":4,"name":"职场","title":"职场"},{"count":2,"name":"水泥座","title":"水泥座"},{"count":2,"name":"民营企业","title":"民营企业"},{"count":2,"name":"星座","title":"星座"}],"origin_title":"","image":"https://img1.doubanio.com/mpic/s6169418.jpg","binding":"","translator":[],"catalog":"","pages":"252","images":{"small":"https://img1.doubanio.com/spic/s6169418.jpg","large":"https://img1.doubanio.com/lpic/s6169418.jpg","medium":"https://img1.doubanio.com/mpic/s6169418.jpg"},"alt":"https://book.douban.com/subject/4841316/","id":"4841316","publisher":"人民文学出版社","isbn10":"7020079067","isbn13":"9787020079063","title":"水泥座女人","url":"https://api.douban.com/v2/book/4841316","alt_title":"","author_intro":"子非：\n北大法学学士，美国MBA。典型的射手女，非典型的80后。在公关、品牌领域有多年从业经验，曾任知名民企公关总监。有知识有理想，对人生无畏惧无强求。喜欢用简单的心看纷扰的事，坚信大智慧存在于小事中。\n瑜玥：\n在北大一塔湖图的徜徉中度过了美妙的七年时光，崇尚自由。\n怀揣着战地记者的梦想开始了媒体人的职业道路，坚持不懈。\n感性多于理性，在客观严谨的工作之余，喜欢用文字记录对生活的感悟。热情与柔情并重，在喜怒哀乐苦辣酸甜中，认真体味并享受人生的每一个动人时刻。","summary":"《水泥座女人:职场公关进阶实录》是一部讲述白领在地产企业公关领域打拼的职场小说。它不仅仅是企业危机公关的情景实录，也告诉你职业攀升的性别法则，更是白领在职场斡旋、公关通关的实用指引。\n它讲述的，并非乙方公关公司的公关案例，而是发生在地产企业公关部的一场场危机公关实录。它展示的，不仅仅是媒体公关的专业技能，更包括下属对上司的公关、公司内跨部门公关等等大公关的技巧与智慧。\n大公关，远不止是专业从业者的公共关系处理工作，它渗透于公司中的各个岗位；大公关，不只是企业的战略与战术，更是白领在职场打拼中不可或缺的技能\u2014\u2014公关你的客户获得订单，公关你的投资人获得资金，公关你的同事获得支持，公关你的老板获得晋升！","price":"20.00元"},"book_id":"4841316","id":1150421367},{"status":"wish","updated":"2017-02-11 00:59:05","user_id":"1296936","book":{"rating":{"max":10,"numRaters":233,"average":"7.4","min":0},"subtitle":"","author":["庄淑芬"],"pubdate":"2000-10","tags":[{"count":145,"name":"广告","title":"广告"},{"count":125,"name":"奥美","title":"奥美"},{"count":90,"name":"庄淑芬","title":"庄淑芬"},{"count":57,"name":"职场","title":"职场"},{"count":34,"name":"管理","title":"管理"},{"count":21,"name":"生活方式","title":"生活方式"},{"count":11,"name":"心情","title":"心情"},{"count":9,"name":"文化","title":"文化"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s1177765.jpg","binding":"平装","translator":[],"catalog":"一位女性企业经营者的酸甜苦辣告白／韦俊贤\n她不戴盔甲，她用心经营／徐璐\n这本书所吸引我的／孙大伟\n一份祝福／宋秩铭\n自序半路出家，真情告白\n一、管理静思\n1.久哈利的四间心房\n2.让世界大\u201c不\u201d同\n3.新好企业为员工安家\n4.领导我，不要控制我\n5.读书，这一件事\n6.潮起潮落春去春回\n7.青蛙窥浴，蝴蝶洗脸\u2015\u2015泰国丛林魔鬼营\u201c野战\u201d经验\n8.感同身受的小小意外\n9.在这儿工作充满乐趣\n10.品牌至上的整合行销\n11.尊重品牌必得永生\n二、伟大球员出招\n12.当我们一起共舞时\n13.那一夜，我们一起大声欢唱\u2015\u2015歌舞线上，精灵出招\n14.俄罗斯娃娃\u2015\u2015巨人与侏儒\n15.新一代的摩登凯旋门\u2015\u2015No Fun，No Work！\n16.用心做事，用脑带人\n17.发乎善心说真话\n18.长跑竞争载舟覆舟\n19.对不起！此路不通\n20.写给秘书们的一封信\n21.一种升官，百种感言\n22.一个广告人专业的省思\n三、好男好女\n23.冲破玻璃屋顶\u2015\u2015我们女孩可以做任何事！\n24.女性的宁静革命\n25.不做强人，宁为专业女性\u2015\u2015为勇往直前的专业女性喝采\n26.共存共荣的惺惺相惜\n27.人生中小小的死亡\n28.向好男人致敬！\n29.她们事业有成\n30.再年轻一次\n31.寻找大未来的出口\u2015\u201521世纪现代女性职场探索\n32.纵横21世纪，我心也狂野\u2015\u2015寄望现代女性的有所为与有所不为\n四、选择人生\n33.团员共聚到曲终人散之后\u2015\u2015人有学习独处之必要\n34.大放异彩的打蛋高手\n35.说与被说的世界\n36.不妨也来做梦许愿\n37.忙里偷闲住院记\n38.一种浸淫自律的快感\n39.人生不可匮乏的友谊\n40.为什么大家怕你？\n41.鸡尾酒会现形记\n42.亲子新关系中的\u201c阳光、空气、水\u201d\n43.终极的吸引力\n44.转弯时的守护神\n45.千山万水与我同行\n46.学习使旧情复燃\n47.三校合一，不只三效合一\n48.教书生涯原是梦\n49.纽西兰随波逐流记\n50.心安理得的成就感\n51.也谈黄色笑话\n52.我的书房我的梦\n53.轻舟已过万重山\n五、分享与鼓舞\n54.很早就想写信谢谢你\u2015\u2015小兵立大功的卡片\n55.挫折是年轻人最好的祝福\n56.生命中宝贵的第一次机缘\n57.浮光掠影的职业识别\n58.敞开胸怀接受批评\n59.山不转路转的日子\n60.我所怀念的异国故人\n61.也是一种脱轨游戏\n62.开会现形记\n63.天长地久守住\u201c奥美\u201d情\u2015\u2015葛伯伯的故事\n64.回首来时路\n65.一位老板的告白\n66.缘份让我们一起相会\n67.如何当办公室的当红炸子鸡？\n职场答问录\n1.公司没有绝对的坏人\n2.选择过渡期工作，给所学所用一个机会吧\n3.放弃学习成长的人注定失败\n4.内向、外向，不是选择工作的绝对条件\n5.只要是专才，皇亲国戚也不怕\n6.谁能教我不要再换工作？\n7.不景气不是原地踏步的藉口\n8.职场婚外情，去不去职两难\n9.放个长假缓冲低潮期\n10.我想转调，主管不放人，怎么办？\n11.50岁再求职，阻挠特别多？\n12.如何与老板互动求取双赢？\n13.多读书，可补非科班之不足\n14.转陀螺的生活，这是我要的吗？\n15.抓住重点，贩卖自己，递一张有创意的履历表\n16.面对主管性搔扰，我该怎么办？\n17.防骚七部曲，教你如何自保\n18.向不合理勇敢说No\n19.老板话匣子一开，凡人无法挡\n20.协助属下成长发光，主管责无旁贷\n21.别人升官没我的份儿，郁卒啊！\n22.社会新兵如何开步走？\n23.当理想与现实不符，何去何从？\n24.职场上交不到真正的朋友？\n25.与上司不对盘，注定工作生波\n26.主管爱刁难高学历部属？\n27.沟通不良，令人头痛\n28.我爱慕的小男同事，只爱美眉\n29.事情闲散，考虑不如离去，景气差，担心工作不好找\n30.孩子气太重，会不会影响工作？\n31.无法和自己不喜欢的人共事？\n32.我和老板蜜月期结束了\n33.与老外主管共事之道\n34.老公让女同事搭便车，我怀疑\n35.你可以低潮，但要有个期限\n36.团结是面对不平待遇的利器\n37.学习语言不给自己有藉口\n38.薪水重要，还是快乐重要？\n39.主管遭贬，我还有前途吗？\n40.跨越人际鸿沟，每天试着真心称赞别人\n41.应征时可能面对的5个问题\n42.想要出人头地，何必在乎超多的工作量？\n43.擅打团队牌，可发挥成员长处\n44.不喜与人争锋头，我成了主管眼中的黑名单\n45.年终机会多，下一个工作会更好？\n46.年终将至，人心思动\n47.今年的考绩你满意吗？\n48.薪资多一百元也是肯定\n49.你的工作值得长期耕耘吗？\n50.为什么上司认为你工作\u201c闲闲\u201d？\n51.解冻冰冷老板四部曲\n52.流言最易打击员工士气\n53.你是专业的服务业人员吗？\n54.对自己好的第一步\u2015\u2015善待时间\n55.找个学习对象，改进自己\n56.职场没有绝对的朋友\n57.两性平权，大势所趋\n58.很多事主管是看在眼里的！\n59.别座山总是比较高！\n60.女性不必过度强出头？\u201c大男人\u201d老板的传统观念应修正\n61.我有个授权放手的主管\n62.中文系毕业难找事吗？\n63.佳偶能否在同一屋檐下共事？\n64.会吵的小孩有糖吃？\n65.我和主管没缘份？\n66.新人不怕问笨问题\n67.我和客户愈看愈不对眼\n68.工作不如意我想逃\n69.何必为新新人类贴标签！\n70.工作时间长不代表生产力高\n我的奥美书缘\u2015\u2015代编者后记／徐智明","pages":"362","images":{"small":"https://img3.doubanio.com/spic/s1177765.jpg","large":"https://img3.doubanio.com/lpic/s1177765.jpg","medium":"https://img3.doubanio.com/mpic/s1177765.jpg"},"alt":"https://book.douban.com/subject/1001972/","id":"1001972","publisher":"企业管理出版社","isbn10":"7801474074","isbn13":"9787801474070","title":"奥美有情","url":"https://api.douban.com/v2/book/1001972","alt_title":"","author_intro":"庄淑芬 资深广告人，经历台广、联广、华商、国泰建业等台湾本土广告公司，于1985年正式加入奥美广告公司至今。\n1990年曾至伦敦奥美广告公司工作，1991年3月或任台湾奥美广告公司总经理，2000年1或任台湾奥美整合行销传播集团董事长。多年来，参加无数次世界奥美在欧洲与亚太区举办的专业训练课程，也曾担当台湾辅仁大学大众传播系讲师。1987年译著《广告大师\u2015\u2015奥格威未公诸于世的选集》，1996年译著全新版《如何做广告》并曾担任中国时报专栏写作。目前兼任奥美内部刊物《观点》总编辑，并催生《奥美的观点》一书。\n1996\u20151997连续两年当选台北市广告人经营者联谊会（4A）理事长\n1996年奥美广告被广告杂志评鉴为\u201c风云代理商\u201d，动脉杂志票选作者为广告界风云人物；1997\u20151999年天下杂志连续票选评鉴奥美广告为\u201c最佳声望标竿企业\u201d之一；多年来台湾奥美广告在诸多媒体票选中均获选为台湾大众传播系学生心目占最想进入的广告公司。","summary":"如果你问谁是台湾广告界最德高望重的女人，毫无疑问地，答案必定是庄淑芬！在早年阳盛阴衰的广告界她不仅为女性企业领导人开了先锋，更实地参与打造了台湾广告界成就傲人的奥美王朝。在本书中这位目前统领员工总数近四百人的企业掌门人想要与大家分享的，是她在奥美长达15年广告生涯中的点点滴滴，你将同时看到一个企业领导人坚毅的处世哲学，以及同在她身上的\u2026\u2026别一个婉约女子的心情故事。","price":"29.60"},"book_id":"1001972","id":1150420719},{"status":"wish","updated":"2017-02-11 00:58:33","user_id":"1296936","book":{"rating":{"max":10,"numRaters":48,"average":"7.2","min":0},"subtitle":"","author":["吴锦屏"],"pubdate":"2007-9","tags":[{"count":19,"name":"公关","title":"公关"},{"count":12,"name":"传记","title":"传记"},{"count":10,"name":"PR","title":"PR"},{"count":3,"name":"励志","title":"励志"},{"count":2,"name":"成长","title":"成长"},{"count":1,"name":"营销","title":"营销"},{"count":1,"name":"术业","title":"术业"},{"count":1,"name":"公车读物","title":"公车读物"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s5771902.jpg","binding":"","translator":[],"catalog":"","pages":"156","images":{"small":"https://img3.doubanio.com/spic/s5771902.jpg","large":"https://img3.doubanio.com/lpic/s5771902.jpg","medium":"https://img3.doubanio.com/mpic/s5771902.jpg"},"alt":"https://book.douban.com/subject/2307583/","id":"2307583","publisher":"武汉大学出版社","isbn10":"7307057662","isbn13":"9787307057661","title":"放胆去梦想","url":"https://api.douban.com/v2/book/2307583","alt_title":"","author_intro":"","summary":"台湾传奇女性、\u201c魅力公关代言人\u201d吴锦屏的创业激情与梦想！\n一通百通的职场秘笈，举一反三的实战教例\n从默默无闻的平凡家庭出身，到国际级的公关高手，她的成功带给你怎样的启示\n懂得生活，享受生活，她的均衡人生告诉你如何实现工作和生活的双赢\n\n这是一部创业激情与梦想的书，作者在台湾公关界颇有盛名，全书分为上、中、下三篇，上篇写作者个人的奋斗、成长历程；中篇为职场启示录，总结了职场生存的各种法则，其中又分part1、part2、part3三部分，对老板、学生、新人都提出宝贵的忠告及建议；下篇为实战案例篇，传授公关秘诀；通过一个个精彩纷呈的公关个案展示了作者的个人美丽和职场风采，对公关业内、营销从业人员以及创意设计人员都有实际指导意义。","price":"18.00元"},"book_id":"2307583","id":1150420477},{"status":"wish","updated":"2017-02-11 00:57:48","user_id":"1296936","book":{"rating":{"max":10,"numRaters":529,"average":"6.6","min":0},"subtitle":"赫连娜职场蜕变计","author":["宋丽晅"],"pubdate":"2009-1","tags":[{"count":127,"name":"职场","title":"职场"},{"count":94,"name":"职场小说","title":"职场小说"},{"count":44,"name":"公关","title":"公关"},{"count":40,"name":"小说","title":"小说"},{"count":40,"name":"励志","title":"励志"},{"count":40,"name":"不认输","title":"不认输"},{"count":16,"name":"成长","title":"成长"},{"count":8,"name":"社会","title":"社会"}],"origin_title":"","image":"https://img1.doubanio.com/mpic/s3609047.jpg","binding":"平装","translator":[],"catalog":"《不认输》楔子：倒霉的复试第一章  职场菜鸟  奇怪的录取标准  为自己加油  做个职场没心没肺的女人  别在上班第一天渴望得到友情  公关的真谛  不要忽视供应商  RP版[三从四得]  即使脆弱也不能让别人看到，这就是职场  无限扩大一个点第二章  暗流汹涌  见人下菜碟  客户不一定是上帝  三个月定律  好员工的标准  欢送会上的启示  新官上任  日本料理的启示  没有十全十美  冰火两重天第三章  危机公关  工资是客户给的  享受与奋斗  集体智慧最强大  痛并快乐着  重磅新闻  媒体集体失语  漂亮的公关手段  先学做人再学做事第四章  爱情崩塌  一切都不再  傻子才悲伤  还能笑真好  再委屈也绝不离开  计划永远赶不上变化  爱不在，就放手  突如其来的幸福  幻灭时的游戏  宿醉过后的坚强  和过去永不再见第五章  危机重重  人生的事谁也说不准  严格又苛刻的家伙  青面獠牙型的上司是职业发展的贵人  分别的时刻  遭遇强吻和偷拍  危险游戏  纠缠又混乱的局面  职场潜规则  在开始的地方结束  找到对的人，做对的事第六章  破除魔咒  真的失望了  新官上任三把火  开场舞  前途未卜  你值得我这么做  放弃也需要勇气  职场伙伴更重要  谁是谁的天使  爱情摩天轮《杜拉拉升职记1》DB人物表引子：三个月的民企生涯01.忠诚源于满足02.单相思与性骚扰的区别03.老板心中谁更重要04.和上司要保持一致06.\u201c预算与排期\u201d07.管理层关心细节吗？08.专业质疑与先兆流产09.5％就够了10.别搞不清楚谁是老大11.老板们的不同特点12.话不投机13.受累又受气该怎么办14.猜猜为啥请晚餐15.1001个笑话16.最后的玫瑰17.招人难，求职也难18.职场天条：慎用MAIL19.\u201c自下而上\u201d还是\u201c自上而下\u201d20.两位同僚21.要当经理就别想轻松：学习与承压22.认可须及时23.\u201cYou deserve it\u201d的两种中文解释24.教会徒弟饿死师傅25.老板你应该清楚我为啥要走26.上下级之间的匹配27.在狮子和老虎之间游走28.空手套白狼29.又笨脾气又大的下属30.我保证以后一直对你好31.官僚就是该做决定时思考，遇到困难时授权32.杀机33.不是你说自己好就算数、得大家都说你好才算\u2014\u2014\u201c360度评估\u201d34.设定工作目标要符合\u201cSMART原则\u201d35.员工最重视的事情：晋升和加薪36.功高压主37.整个我的人整颗我的心交给你的时候38.个人权力太大会妨碍组织的安全39.充满变数的时期40.\u201c有过\u201d和\u201c同步\u201d41.SOP的多种功能42.专业的秘书43.偷听者44.惊变45.我只要发现你骗我一次，你就是个不值得信任的人46.要为下属的成长付出心血47.ASSESSMENTCENTER(评估中心)48.什么叫\u201c不道德\u201d49.埋伏50.筹码51.高参52.如何处置这样的\u201c三期\u201d员工53.自由自在的活54.执子之手，与子成说《杜拉拉升职记2》自序DB人物表1.离开的成本2.知道不知道？3.捍卫个人和只能尊严的经典4.焦虑的三十五岁5.野百合也有春天6.UP的故事7.提问也需要程度8.基于事实的沟通，说\u201c你迟到一小时\u201d，不说\u201c你没有时间观念\u201d9.当我们是新人的时候10.管理培训生\u2014\u2014\u201c弱智\u201d还是\u201c有害\u201d11.管理培训生\u2014\u2014百个里头挑半个12.可有可无的人，随时可被替代13.使别人愿意教你，是你自己的责任14.传递信息要分阶段15.秘密知道得太多的人16.统一的谈话模板，强大的赞美功能17.看资源和指标，还是看市场潜力18.新老板需要的是表决心19.想做经理的人1\u2014\u2014标准20.想做经理的人2\u2014\u2014上交矛盾的成本21.想做经理的人3\u2014\u2014四十岁的激情和能力22.想做经理的人4\u2014\u2014性格极端是最坏的情况23.想做经理的人5\u2014\u2014在影响力和驱动力之间选择24.想做经理的人6\u2014\u2014愤怒的猎头25.想做经理的人7\u2014\u2014跳槽动机26.想做经理的人8\u2014\u2014该做的事和容易做的事27.什么叫READY FOR NEXT LEVEL28.择偶是改变命运的第二次机会29.财富的积累需要假以时日30.愤怒的\u201c捞妹\u201d31.老板不好自有老板的老板教训，下级要先做到下级的本分32.WHY比WHAT更重要33.当不了\u201c技术派\u201d，当好\u201c感觉派\u201d也不错34.一个幸福指数高的房奴35.不用期望抄底，大势看涨就可买入36.高潜力人才的特征\u2014\u2014永不满足现状37.会议的经典38.别讲现任经理坏话，因为新经理会想：你和他那么闹，没准以后和我也那样39.70％的人曾因管得太细想跳槽，其中半数付诸了行动40.授权的依据和程度41.开会的原则与慎用感叹号42.将漂亮进行到底43.懂事是值钱的44.下属无性别45.落袋为安46.被嘲笑或者被怜悯47.求职的滋味48.沉浸地赚钱49.我一直认为，你我会情长意久《杜拉拉升职记》大事记","ebook_url":"https://read.douban.com/ebook/13652526/","pages":"272","images":{"small":"https://img1.doubanio.com/spic/s3609047.jpg","large":"https://img1.doubanio.com/lpic/s3609047.jpg","medium":"https://img1.doubanio.com/mpic/s3609047.jpg"},"alt":"https://book.douban.com/subject/3426322/","id":"3426322","publisher":"陕西师大","isbn10":"7561344457","isbn13":"9787561344453","title":"不认输","url":"https://api.douban.com/v2/book/3426322","alt_title":"","author_intro":"宋丽晅，英文名Avril，，闯荡职场十余年，成熟、干练。拥有五星级酒店管理、以及时尚、专业美容类杂志主编等从业经验。现和朋友经营化妆品公司。\n自诩为爱写作、为爱漂流、为爱朝圣的女子，一个激情澎湃又沉敛如水的女子。\n喜欢坦然的人生，因为人生没有如果，把握现在才是最重要的。\n职场感言\u2014\u2014我们应记住该记住的，忘记该忘记的；改变能改变的，接受不能改变的。","summary":"《不认输》是一本可以提升你斗志的励志小说。小说主人公赫连娜长相平平，条件一般，机缘巧合下进入了世界顶尖公关公司，担任AE。同事不友好、领导不满意、客户不认可\u2026\u2026职场新人能够遭遇的挫折她都经历了个遍，更糟糕的是情感上还备受打击，相爱数年的初恋男友竟和自己最好的朋友走到了一起。\n她没有放弃自己坚持，凭借超强的毅力战胜了所有困难，最后获得了事业和爱情的双丰收。\n小说开头引用了荆棘鸟的传说：有一种鸟为了唱出最动听的歌声，寻找到荆棘树后，让锋利的荆棘入肉身，浑身鲜血淋漓也在所不惜。\n现实远比荆棘更残忍。我们可以失败、可以疼痛、可以流泪，甚至可以流血，但我们绝不可以认输。而只要不认输，就一定能收获最后的胜利的喜悦。\n当我们看了太多\u201c职场生存手册\u201d、\u201c商战胜经\u201d后，我们或许更需要一种永不言败的力量，特别对于刚入职场的新人而言，在冬意正浓的当下，斗志精神远比那些生硬的说教来得更有意义。","ebook_price":"6.00","price":"24.80元"},"book_id":"3426322","id":1150420186},{"status":"wish","updated":"2017-02-11 00:56:51","user_id":"1296936","book":{"rating":{"max":10,"numRaters":47,"average":"7.9","min":0},"subtitle":"","author":["麦子"],"pubdate":"2011-8","tags":[{"count":32,"name":"互联网","title":"互联网"},{"count":31,"name":"职场","title":"职场"},{"count":21,"name":"小说","title":"小说"},{"count":19,"name":"公关","title":"公关"},{"count":9,"name":"潜规则","title":"潜规则"},{"count":7,"name":"道德","title":"道德"},{"count":6,"name":"商战","title":"商战"},{"count":4,"name":"中国","title":"中国"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s6916104.jpg","binding":"平装","translator":[],"catalog":"第一章 祸 起\n成晓毅一拍桌子，发出一声憋着劲的怒吼：\u201c王八蛋！你们也太拿人不当人了！\u201d王海舟拍拍本子，语重心长，\u201c钝刀拉肉，对谁都不好。\u201d\n第二章 灭 火\n听到这个标题，苏涵大脑瞬时充血。看来，这次的麻烦不小，好事不出门，坏事传千里！丁姗姗盯着电脑：\u201c唉，这就是传说中的公关危机啊。\u201d\n第三章 空 降\n苏涵也赤裸裸地提出了自己的要求：\u201c咱们得找专业的人，干专业的事儿，你得给人，给钱。咱不能再是小米加步枪了。\u201d\n第四章 过 招\n苏涵倒吸一口凉气，这个女人不寻常，真够硬朗的，自己本来想着和稀泥，在维持一团和气的前提下，给曹胖一个改进的机会，可琳达看来早想好了，顺我者昌，逆我者亡！\n第五章 找 茬\n来者都不善啊。尽管问题的核心没问题，但这里面非要暗藏一个小杀机，琳达心里暗叹，媒体都不是好摆弄的。\n第六章 明 争\n宋云朋握着电话，愣在了那里，抱歉，抱什么歉？忙活了半天，你一声抱歉，我就算是穷折腾了？宋云朋\u201c哼\u201d了一声，这世上，哪有这么便宜的事儿啊！\n第七章 暗 斗\n苏涵想起来，那天，他还给成晓毅出主意：\u201c新闻炒作，要有针对性，你们现在缺投资，要炒作投资人关注的新闻点。\u201d得，现在，他们还真用上了。\n第八章 乱 战\n腌臜事儿，就像一袋垃圾，如果没挑破，掂出去悄无声息地扔了，大家都清爽，一旦挑破了，污物横飞，且得一阵子收拾呢。\n第九章 交 易\n苏涵犹豫了一下：\u201c我们不会辜负宋总对我们的帮助的！\u201d宋云朋一拍桌子：\u201c痛快！好！我们不说了，到此为止。来来来，咱们喝酒。\u201d听着这赤裸裸的交易，郭小峰疲惫地两手搓着脸，倒在椅子背上。\n第十章 叫 板\n宋云朋摘下耳机，\u201c啪\u201d地一拍桌子：\u201c卑鄙！\u201d宋云朋咬着牙，他能感觉到自己脑门上的青筋在突突地跳。\n第十一章 抹 黑\n那些骂I乐网无良的人，也被另一群网友骂成是黑媒体的五毛党。这一招，叫鱼目混珠。以其人之道，还治其人之身，谁叫你自己也不干净呢？\n第十二章 失 焦\n两种声音，纠缠在一起，像两条发情的蛇，一路缠绕着，撕扯不开。苏涵暗自感叹，这公关，就是一个大染缸，你趟了这道水再出来，谁知自己身上会脏成什么样？\n第十三章 真 相\n宋云朋拍拍郭小峰的肩：\u201c这个秘密，能直刺雪多力的心脏。当然，这一次，咱们沉住气，多请教一下科学院的专家。咱们，不鸣则已，一鸣惊人。\u201d\n第十四章 坍 塌\n凯文叹了口气：\u201c创业者，最大的悲哀在于失去了控制权，你知道大家为什么都反对停止雪多力的销售吗？\u201d苏涵默然，等凯文解开谜底，苏涵大吃一惊!\n第十五章 抉 择\n在苏涵看来，公关的努力，没有必要了。食品安全事关民生，哪怕是一点瑕疵，都会引来汹汹声讨。更糟糕的是，拼命掩盖真相的五毛写手，更是激起了网民的愤怒。","pages":"258","images":{"small":"https://img3.doubanio.com/spic/s6916104.jpg","large":"https://img3.doubanio.com/lpic/s6916104.jpg","medium":"https://img3.doubanio.com/mpic/s6916104.jpg"},"alt":"https://book.douban.com/subject/6773229/","id":"6773229","publisher":"五洲传播出版社","isbn10":"7508520785","isbn13":"9787508520780","title":"底线.com","url":"https://api.douban.com/v2/book/6773229","alt_title":"","author_intro":"麦子，本名张学涛，曾供职南方都市报、百度。","summary":"《底线.com》主要内容简介：在中国，所有的互联网公司都有一个共同的域名：《底线.com》当职场的职责逾越你的原则，当利益与良知博弈，你是否还要坚守自己的底线？当职场不仅仅是办公室恋情，不再是励志童话，而是生存和淘汰的抉择，你是否还能从容应对？冷血裁员、致命网游、食品安全危机\u2026\u2026在这一场场互联网公司的公关大战中，每一个登场的人都是那么的熟悉，似乎就是我们的上司，我们的同事，我们的朋友，我们身边的每一个人，甚至，还有我们自己。身在职场，当道德底线遭遇潜规则，你将如何抉择？《底线.com》由麦子编著。","price":"34.00元"},"book_id":"6773229","id":1150419747},{"status":"wish","updated":"2017-02-11 00:53:10","user_id":"1296936","book":{"rating":{"max":10,"numRaters":155,"average":"7.6","min":0},"subtitle":"奥美资深公关人的职场平衡智慧","author":["丁菱娟"],"pubdate":"2012-9","tags":[{"count":98,"name":"职场","title":"职场"},{"count":62,"name":"公关","title":"公关"},{"count":61,"name":"女性","title":"女性"},{"count":24,"name":"成长","title":"成长"},{"count":24,"name":"个人管理","title":"个人管理"},{"count":16,"name":"美丽的女人，美丽的书","title":"美丽的女人，美丽的书"},{"count":16,"name":"工作思考","title":"工作思考"},{"count":14,"name":"营销","title":"营销"}],"origin_title":"","image":"https://img1.doubanio.com/mpic/s23008768.jpg","binding":"平装","translator":[],"catalog":"一、公关业内事\n1\u201c服务\u201d与\u201c顾问\u201d的差别\n2 有观点就有价值\n3 营销人的门里门外\n4\u201c蹲马步\u201d的必要\n5 创意一定要与众不同吗？\n6 魔鬼藏在细节\n7 为什么你不是经理？\n8 白纸黑字有道理\n9 合约没说的更重要\n10提升沟通效率\n11先下标题再说话\n12用故事说话\n13发言人的修为\n14学习说\u201c不\u201d\n15虎口下的反败为胜\n16在乎客户所在乎的\n17 为何一通电话值百万\n18 做个聪明的客户\n二、态度是一种美\n1 专业里的真心\n2 立场坚定 语气和缓\n3 情、理、法 孰重?\n4 拿掉自己 看得更清楚\n5 没有事实，只有诠释\n6 不要自己吓自己\n7 话说半分满，事做一分满\n8 持续的力量\n9 不受所学限制\n10 从老板身上学习\n11 老板也需要被鼓励\n12 看透不点破\n13 打网球时的感悟\u2014\u2014得失心\n14 把自己当别人\n15 向诱惑说NO\n16 好聚好散\n17 先拥有再放下\n三、做老板的智慧\n1\u201c做跳蚤\u201d还是\u201c当大象\u201d？\n2 事必躬亲并非好主管\n3 学会授权，让我们看得更高更远\n4 员工里的\u201c猎人\u201d与\u201c农夫\u201d\n5 看见每个员工的优点\n6 爱你的对手\n7 相信直觉\n8 乐意当个服从者\n9 学着撤退\n10 坚守两条线\n11 让我们赌一局吧！\n12 缩小自己、放大别人\n13 说对话，得人缘\n14 留点距离，让我们更近\n15 难以割舍的革命情感\n16\u201c快去快回\u201d\n17 不要在伙伴间挖角\n四、回首来时路\n1 不要留在舒适区\n2 无招胜有招\n3 知识 见识 胆识\n4 用纪律换取更多自由\n5 判断、比较、放大\n6 时机比时间重要\n7 何苦为双袜子买双鞋？\n8 懂得休息才懂得工作\n9 揣摩上意坏大事\n10 碰个面，喝杯咖啡吧！\n11 认输才懂赢\n12 保持住热情\n13 先爱自己，才能爱别人","ebook_url":"https://read.douban.com/ebook/441868/","pages":"164","images":{"small":"https://img1.doubanio.com/spic/s23008768.jpg","large":"https://img1.doubanio.com/lpic/s23008768.jpg","medium":"https://img1.doubanio.com/mpic/s23008768.jpg"},"alt":"https://book.douban.com/subject/11577301/","id":"11577301","publisher":"浙江大学出版社","isbn10":"7308102971","isbn13":"9787308102971","title":"专业与美丽","url":"https://api.douban.com/v2/book/11577301","alt_title":"","author_intro":"17岁，写下一曲《给你，呆呆！》，获\u201c金韵奖\u201d并传唱台湾民谣圈；\n毕业后，就职宏碁和精英电脑，亲历台湾第一代企业公关人的诞生、成长；\n33岁，在经济不景气时毅然逆流而上，自行创立高科技公关公司，当起老板；\n40岁，又把公司卖给跨国传播巨擘奥美集团，自此，她从本土创业者成长为一名跨国集团的职业经理人。\n她，就是世纪奥美公关顾问公司的董事长，丁菱娟。\n\n如今的丁菱娟，在业内被称为\u201c全台湾科技业公关第一把交椅\u201d\u2014\u2014前后累积了20多年的公关营销经验，服务过上百家客户，深获众多CEO的信任，已成为台湾公关界的\u201c意见领袖\u201d。英特尔、思科、戴尔等国际知名IT公司都指定由她负责台湾地区的公关事务；大陆的阿里巴巴也曾多次请她的公司来策划公关活动。\n\n她年轻时曾一手创立台湾廿一世纪公关公司，1994年获选台湾\u201c最佳企业经理人\u201d奖；后于2002年携团队加入全球奥美公关集团，整合为世纪奥美公关顾问公司。在丁菱娟的带领下，世纪奥美业绩年年增长，成为奥美传播集团中的\u201c模范生\u201d，和台湾公关公司的领先者之一，并于2004及2005连续两年被《动脑杂志》评为\u201c台湾地区最佳公关公司\u201d第一名。\n丁菱娟拥有淡江大学中文系学士学位及美国宾州布鲁斯堡大学（Bloomsburg University of Pennsylvania）企业管理硕士学位。","summary":"《专业与美丽:奥美资深公关人的职场平衡智慧》集结了资深公关人丁菱娟在台湾《经济日报》等刊物上发表的专栏文章，展现了这样一名从曾经的文艺少女成长为干练、成功的职业经理人的女性，在职场和创业当中对专业精神的感悟，以及她始终保持着的那份率性、美丽的真性情。\n站在公司老板和\u201c过来人\u201d的角度，丁菱娟用篇篇短文提点读者，如何专业地摆平各种棘手难题、如何明智地权衡情理法、以及如何平衡工作与生活的关系，进而找到快乐工作的秘方：专业是谋生的必备基础，美丽是人脉关系的加值条件。","ebook_price":"12.00","price":"32.00元"},"book_id":"11577301","id":1150418121},{"status":"read","rating":{"max":5,"value":"4","min":0},"updated":"2017-01-08 17:13:29","user_id":"1296936","tags":["职场","小说"],"book":{"rating":{"max":10,"numRaters":310,"average":"7.9","min":0},"subtitle":"","author":["舒仪"],"pubdate":"2013-11-1","tags":[{"count":77,"name":"职场","title":"职场"},{"count":54,"name":"舒仪","title":"舒仪"},{"count":52,"name":"女性","title":"女性"},{"count":40,"name":"成长","title":"成长"},{"count":38,"name":"情感","title":"情感"},{"count":35,"name":"都市","title":"都市"},{"count":33,"name":"小说","title":"小说"},{"count":26,"name":"格子间女人","title":"格子间女人"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s27095601.jpg","binding":"平装","translator":[],"catalog":"Chapter1  离开/001\n他有极修长的手指，却触手冰凉，似一段多年前就冷却的生命。\nChapter2  挑战/025\n职场中没有怀才不遇这回事，我们只会找个角落，反省自己学艺不精。\nChapter3  面对/054\n生活就是一个问题叠着一个问题，你总要学会去对付它们。\nChapter4  不舍/080\n多少人曾爱慕你年轻时的美貌，可我更爱你经受过岁月摧残的容颜。\nChapter5  邀约/106\n每次见到他不是开心而是害怕，她原本坚定执着的心，也因之变得患得患失，辗转反侧。\nChapter6  梦想/143\n没有任何人、任何环境能够毁灭你的光荣和梦想，除了你自己。\nChapter7  意外/161\n曾经令男性侧目的强悍此刻通通远去，重新还原为女性的柔弱，眼中只有哀伤和依赖。\nChapter8  埋藏/188\n她只能将那晚的记忆深深地埋藏起来，生怕一见天日，那点暖人的温度便会随风飘逝。\nChapter9  阴影/210\n死亡就像地球上的水一样，你逃不开也避不过，总有一天要学会面对。\nChapter10  记忆/226\n习惯是一件可怕的事，总在不经意的时刻，提醒人们已经淡忘的记忆。\nChapter11  心伤/245\n我做梦，梦见我从来没有去过甘南，那些都是噩梦，我还是原来的我。\nChapter12  选择/263\n她自己选择了一个人站在这里承受秋风的萧瑟。她只有忍受，愿赌服输。\nChapter13  剥离/285\n对错无妨，她只想往前走，不轻言后悔，不难为自己。\nChapter14  温暖/305\n这一刻他的嘴唇柔软而温暖，那吻却极深极深，他对她百般心碎的感觉，全在其中。\nChapter15  刺痛/329\n旁人只能看到他春风化雨一般的职业化微笑，没有人想得到光鲜背后的真相。\nChapter16  追寻/346\n我们这一生，要经历很多诱惑和伤害，但唯有生命与爱，不可辜负。\nChapter17  重生/365\n过去的一切都已过去，生命本就是一个不断受伤再不断复原的过程。\nChapter18  输赢/386\n任何人任何事，不可能永在风光的顶峰，也不可能永在低谷。低潮的时候只能咬牙坚持，柳暗花明更需要代价。\nChapter19  尾声/404\n虽然花开花落，是逃避不过的规律，但是这一次，谭斌决定尽情享受她的花开时节。","pages":"416","images":{"small":"https://img3.doubanio.com/spic/s27095601.jpg","large":"https://img3.doubanio.com/lpic/s27095601.jpg","medium":"https://img3.doubanio.com/mpic/s27095601.jpg"},"alt":"https://book.douban.com/subject/25748471/","id":"25748471","publisher":"湖南文艺出版社","isbn10":"7540458054","isbn13":"9787540458058","title":"格子间女人：新版","url":"https://api.douban.com/v2/book/25748471","alt_title":"","author_intro":"舒仪，七零年代出生，八零年代成长，九零年代逐渐褪去青涩，二十一世纪开始学习透过现象看本质。名校毕业，多年知名外企经历，职业经理人。工科背景，却深爱文字这种表述方式。外表更具欺骗性，看似温柔实则麻辣，是典型的表里不一，永恒的矛盾统一体。出版作品：《格子间女人》《曾有一个人爱我如生命》。","summary":"《曾有一个人爱我如生命》作者舒仪经典都市女性成长小说，全新修订，独家珍藏。那些年，唯有生命与爱不曾辜负，献给生存并奋斗在职场、情场中的你我。\n走在现代化的写字楼里，随时能听到\u201clady first\u201d，但是女性的声音永远处于劣势。无论场面多么难堪，只能打落牙齿和血吞，不可轻易流露女性的柔弱之态，也不能喋喋不休地逢人诉苦，没有人会因为你是女性而手下留情。每个在职场奋斗的女人都想要独立，想要更多的爱和更多的安全感，其中的辛苦难以描述\u2026\u2026这本小说的魅力正在于此，它并不仅仅是简单的职场感悟或是爱情故事，作者的外企职业背景和出色的情感描绘给予它更丰富的内涵，堪称经典。唐嫣、吴卓羲、莫小棋、李承铉主演同名电视剧敬请期待。","price":"36.00"},"book_id":"25748471","id":1134121949},{"status":"wish","updated":"2017-01-01 10:25:29","user_id":"1296936","book":{"rating":{"max":10,"numRaters":205,"average":"7.6","min":0},"subtitle":"","author":["卡拉·汉瑞丝"],"pubdate":"2010-9","tags":[{"count":266,"name":"职场","title":"职场"},{"count":163,"name":"金融","title":"金融"},{"count":104,"name":"摩根士丹利","title":"摩根士丹利"},{"count":78,"name":"励志","title":"励志"},{"count":71,"name":"商业","title":"商业"},{"count":58,"name":"自我启发","title":"自我启发"},{"count":55,"name":"管理","title":"管理"},{"count":25,"name":"人物","title":"人物"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s4475440.jpg","binding":"","translator":["盛翠菊","张占平","徐凤云"],"catalog":"第1章  我就是力量：做最真实的自我第2章  我是自己的职场规划师：不要患上\u201c他们\u201d综合征第3章  我的90天法则：别用\u201c慢慢适应\u201d当借口第4章  我从不认为是金子就一定会发光：改变别人看待你的方式第5章  寻找我的职场贵人：建立职场\u201c董事会\u201d第6章  我重视并充分利用自己的声音：自己下订单第7章  冒险是我的嗜好：没有风险就没有成功第8章  我的关系能量圈：人脉是互利双赢的第9章  我用激情回馈生活：平衡是一种态度第10章  我坚信我会成功：每一天都展现最佳自我第11章  信仰给我力量：我信守的人生箴言译者后记","pages":"229","images":{"small":"https://img3.doubanio.com/spic/s4475440.jpg","large":"https://img3.doubanio.com/lpic/s4475440.jpg","medium":"https://img3.doubanio.com/mpic/s4475440.jpg"},"alt":"https://book.douban.com/subject/5264604/","id":"5264604","publisher":"万卷出版公司","isbn10":"7547011926","isbn13":"9787547011928","title":"我在摩根士丹利做高管","url":"https://api.douban.com/v2/book/5264604","alt_title":"","author_intro":"现任摩根士丹利公司常务董事，在投资市场从业21年之久。\n\n    她是华尔街的传奇人物，是商界的\u201c黑珍珠\u201d，获得了《财富》杂志\u201c最具影响力人物\u201d、\u201c华尔街黑人75强\u201d、\u201c业务女性50强\u201d、《黑檀》杂志\u201c最佳企业女性15强\u201d、《精英》杂志\u201c影响世界女性50强\u201d、《财富》杂志\u201c美国黑人高级管理人员50强\u201d等众多荣誉和奖项。","summary":"《我在摩根士丹利做高管》讲述了20年前，卡拉\u2022哈里斯像新手一样，刚从商学院毕业，充满智慧，有勤奋的工作态度。但她很快就认识到，在当今这个竞争的环境中，知识和勤奋是根本不够的。卡拉向她的导师和上司寻求建议，但她发现自己得到的忠告常常太大而化之了。因此，随着职业生涯的推进，她建立了自己的\u201c生存工具\u201d，卡拉把它称之为\u201c箴言\u201d，并且卡拉发誓，当她成为高级管理人员的时候，如果有人来征求她的建议，在需要做哪些事才能真正发挥自己的潜力方面，她会给他们提供一些有针对性的、切实可行的建议。在过去的几年中，这些箴言已经受到人们的普遍欢迎，这体现在卡拉许多精彩的演讲和电视专题节目上。借由《我在摩根士丹利做高管》，卡拉与广大职场人士分享了自己的这些\u201c箴言\u201d。","price":"39.80元"},"book_id":"5264604","id":1129906833},{"status":"read","rating":{"max":5,"value":"4","min":0},"updated":"2017-01-01 10:23:00","user_id":"1296936","tags":["职场"],"book":{"rating":{"max":10,"numRaters":185,"average":"8.0","min":0},"subtitle":"","author":["姜立涵"],"pubdate":"2013-6","tags":[{"count":79,"name":"金融","title":"金融"},{"count":74,"name":"职场","title":"职场"},{"count":45,"name":"小说","title":"小说"},{"count":21,"name":"青春","title":"青春"},{"count":17,"name":"都市","title":"都市"},{"count":17,"name":"能够一口气读完的职场小说，非常值得一看","title":"能够一口气读完的职场小说，非常值得一看"},{"count":10,"name":"很好的书","title":"很好的书"},{"count":9,"name":"言情","title":"言情"}],"origin_title":"","image":"https://img1.doubanio.com/mpic/s26717468.jpg","binding":"","translator":[],"catalog":"","pages":"434","images":{"small":"https://img1.doubanio.com/spic/s26717468.jpg","large":"https://img1.doubanio.com/lpic/s26717468.jpg","medium":"https://img1.doubanio.com/mpic/s26717468.jpg"},"alt":"https://book.douban.com/subject/24732461/","id":"24732461","publisher":"","isbn10":"7506368854","isbn13":"9787506368858","title":"CBD风流志","url":"https://api.douban.com/v2/book/24732461","alt_title":"","author_intro":"","summary":"《CBD风流志》内容简介：有这么一群人：他们的手机永远二十四小时开机，加班到凌晨两点半是家常便饭，手头永远有多个项目同时开展，谈工作时敢和客户拍桌子下班时能陪客户喝到醉；他们出入都住五星级，永远都坐商务舱，工作三年买车五年买房；他们衣着光鲜，妆容精致，名牌傍身，每天穿梭在中央商务区（CBD）气势恢宏的高楼大厦里，为CBD带来活力和声气。《CBD风流志》描写的就是这样一群人以及这群人所经历的职场风云。《CBD风流志》以国际著名投资银行在华分支机构为背景，以奋斗在北京CBD金融圈的女主人公为主线，为读者展现一场惊心动魄的职场阴谋和跌宕起伏的行业商战，揭秘在华投行、证券公司、律所、会计师事务所、审计评估等机构的真实生活，将大都市金领的繁华胜景和成败兴衰，与80后一代人的成长故事和惨烈青春，巧妙地穿插在一起，为读者展现出一幅多层次的城市画面。","price":"39.00元"},"book_id":"24732461","id":1129905999},{"status":"read","rating":{"max":5,"value":"5","min":0},"updated":"2016-12-24 23:12:12","user_id":"1296936","book":{"rating":{"max":10,"numRaters":95,"average":"7.9","min":0},"subtitle":"用90后思维管理90后","author":["韩庆峰"],"pubdate":"2014-2","tags":[{"count":65,"name":"管理","title":"管理"},{"count":51,"name":"90后","title":"90后"},{"count":29,"name":"自我提升","title":"自我提升"},{"count":23,"name":"HR","title":"HR"},{"count":14,"name":"代际","title":"代际"},{"count":13,"name":"职场","title":"职场"},{"count":13,"name":"商业","title":"商业"},{"count":13,"name":"人性","title":"人性"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s27208113.jpg","binding":"平装","translator":[],"catalog":"","ebook_url":"https://read.douban.com/ebook/21483827/","pages":"255","images":{"small":"https://img3.doubanio.com/spic/s27208113.jpg","large":"https://img3.doubanio.com/lpic/s27208113.jpg","medium":"https://img3.doubanio.com/mpic/s27208113.jpg"},"alt":"https://book.douban.com/subject/25817260/","id":"25817260","publisher":"中国青年出版社","isbn10":"7515321105","isbn13":"9787515321103","title":"轻有力","url":"https://api.douban.com/v2/book/25817260","alt_title":"","author_intro":"","summary":"","ebook_price":"11.20","price":"28.00元"},"book_id":"25817260","id":1125744289}]
     */


    @SerializedName("count")
    public int count;
    @SerializedName("start")
    public int start;
    @SerializedName("total")
    public int total;
    @SerializedName("collections")
    public List<CollectionsBean> collections;

    public static class CollectionsBean {
        /**
         * status : wish
         * updated : 2018-02-03 10:22:21
         * user_id : 1296936
         * book : {"rating":{"max":10,"numRaters":744,"average":"8.2","min":0},"subtitle":"","author":["张宏杰"],"pubdate":"2007-01","tags":[{"count":439,"name":"历史","title":"历史"},{"count":245,"name":"张宏杰","title":"张宏杰"},{"count":179,"name":"中国历史","title":"中国历史"},{"count":123,"name":"皇帝","title":"皇帝"},{"count":120,"name":"政治","title":"政治"},{"count":98,"name":"中国","title":"中国"},{"count":64,"name":"中国皇帝的五种命运","title":"中国皇帝的五种命运"},{"count":51,"name":"专制","title":"专制"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s10087844.jpg","binding":"16开简裝本","translator":[],"catalog":"自序\n上篇：皇冠下的五种表情\n王莽\n杨广\n朱元璋：心理咨询记录\n正德\n光绪：被\u201c帝王教育\u201d败坏的人\n下篇：皇帝制度的三个维度\n皇帝：最不幸的人\n秦始皇：历史下的蛋\n一强悍的男人\n二统一运动的最后一棒\n三专制构想的执行者\n四君主专制制度的分娩过程：战国改革运动\n先秦：专制的源头\n一寻根溯源\n二中西文化差异的第一推动力\n三王的出现\n四中国独特性的起源\n后记","pages":"304","images":{"small":"https://img3.doubanio.com/spic/s10087844.jpg","large":"https://img3.doubanio.com/lpic/s10087844.jpg","medium":"https://img3.doubanio.com/mpic/s10087844.jpg"},"alt":"https://book.douban.com/subject/1959134/","id":"1959134","publisher":"山西人民出版社","isbn10":"7203057593","isbn13":"9787203057598","title":"中国皇帝的五种命运","url":"https://api.douban.com/v2/book/1959134","alt_title":"","author_intro":"张宏杰，1972年生。蒙古族。1994年毕业于东北财经大学投资系，就职于中国建设银行。2006年调入渤海大学。中国作家协会会员，辽宁作家协会理事，辽宁文学院合同制作家。渤海大学中国文化与文学研究所副所长。著有《大明王朝的七张面孔》、《中国人比韩国人少什么》等多部作品，主要关注中国历史、文化和民族性。","summary":"本书解读了五位皇帝在皇冠压力之下的不同表情：比如王莽，阴差阳错地被\u201c人民\u201d戴上了皇冠，却因为不熟悉权力之车的性能，被中途甩下并碾死。比如杨广，机关算尽地夺取了皇冠，然后又毫无节制地榨取皇冠给他带来的快乐，终于死于权力之酒的酒精中毒症\u2026\u2026这五种表情，既可叹，又可怜。因为\u201c皇帝制度\u201d\n不仅损害着国家民众，也同时伤害着操纵这个制度的统治者。而从某种意义上来说，\u201c皇帝\u201d两个字，包含了解读中国社会的大部分密码。","price":"28.00元"}
         * book_id : 1959134
         * id : 1317581943
         * rating : {"max":5,"value":"3","min":0}
         * tags : ["职场","公关"]
         */

        @SerializedName("status")
        public String status;
        @SerializedName("updated")
        public String updated;
        @SerializedName("user_id")
        public String userId;
        @SerializedName("book")
        public BookBean book;
        @SerializedName("book_id")
        public String bookId;
        @SerializedName("id")
        public int id;
        @SerializedName("rating")
        public RatingBeanX rating;
        @SerializedName("tags")
        public List<String> tags;

        public static class BookBean implements Parcelable {

            /**
             * rating : {"max":10,"numRaters":744,"average":"8.2","min":0}
             * subtitle :
             * author : ["张宏杰"]
             * pubdate : 2007-01
             * tags : [{"count":439,"name":"历史","title":"历史"},{"count":245,"name":"张宏杰","title":"张宏杰"},{"count":179,"name":"中国历史","title":"中国历史"},{"count":123,"name":"皇帝","title":"皇帝"},{"count":120,"name":"政治","title":"政治"},{"count":98,"name":"中国","title":"中国"},{"count":64,"name":"中国皇帝的五种命运","title":"中国皇帝的五种命运"},{"count":51,"name":"专制","title":"专制"}]
             * origin_title :
             * image : https://img3.doubanio.com/mpic/s10087844.jpg
             * binding : 16开简裝本
             * translator : []
             * catalog : 自序
             上篇：皇冠下的五种表情
             王莽
             杨广
             朱元璋：心理咨询记录
             正德
             光绪：被“帝王教育”败坏的人
             下篇：皇帝制度的三个维度
             皇帝：最不幸的人
             秦始皇：历史下的蛋
             一强悍的男人
             二统一运动的最后一棒
             三专制构想的执行者
             四君主专制制度的分娩过程：战国改革运动
             先秦：专制的源头
             一寻根溯源
             二中西文化差异的第一推动力
             三王的出现
             四中国独特性的起源
             后记
             * pages : 304
             * images : {"small":"https://img3.doubanio.com/spic/s10087844.jpg","large":"https://img3.doubanio.com/lpic/s10087844.jpg","medium":"https://img3.doubanio.com/mpic/s10087844.jpg"}
             * alt : https://book.douban.com/subject/1959134/
             * id : 1959134
             * publisher : 山西人民出版社
             * isbn10 : 7203057593
             * isbn13 : 9787203057598
             * title : 中国皇帝的五种命运
             * url : https://api.douban.com/v2/book/1959134
             * alt_title :
             * author_intro : 张宏杰，1972年生。蒙古族。1994年毕业于东北财经大学投资系，就职于中国建设银行。2006年调入渤海大学。中国作家协会会员，辽宁作家协会理事，辽宁文学院合同制作家。渤海大学中国文化与文学研究所副所长。著有《大明王朝的七张面孔》、《中国人比韩国人少什么》等多部作品，主要关注中国历史、文化和民族性。
             * summary : 本书解读了五位皇帝在皇冠压力之下的不同表情：比如王莽，阴差阳错地被“人民”戴上了皇冠，却因为不熟悉权力之车的性能，被中途甩下并碾死。比如杨广，机关算尽地夺取了皇冠，然后又毫无节制地榨取皇冠给他带来的快乐，终于死于权力之酒的酒精中毒症……这五种表情，既可叹，又可怜。因为“皇帝制度”
             不仅损害着国家民众，也同时伤害着操纵这个制度的统治者。而从某种意义上来说，“皇帝”两个字，包含了解读中国社会的大部分密码。
             * price : 28.00元
             */

            @SerializedName("rating")
            public RatingBean rating;
            @SerializedName("subtitle")
            public String subtitle;
            @SerializedName("pubdate")
            public String pubdate;
            @SerializedName("origin_title")
            public String originTitle;
            @SerializedName("image")
            public String image;
            @SerializedName("binding")
            public String binding;
            @SerializedName("catalog")
            public String catalog;
            @SerializedName("pages")
            public String pages;
            @SerializedName("images")
            public ImagesBean images;
            @SerializedName("alt")
            public String alt;
            @SerializedName("id")
            public String id;
            @SerializedName("publisher")
            public String publisher;
            @SerializedName("isbn10")
            public String isbn10;
            @SerializedName("isbn13")
            public String isbn13;
            @SerializedName("title")
            public String title;
            @SerializedName("url")
            public String url;
            @SerializedName("alt_title")
            public String altTitle;
            @SerializedName("author_intro")
            public String authorIntro;
            @SerializedName("summary")
            public String summary;
            @SerializedName("price")
            public String price;
            @SerializedName("author")
            public List<String> author;
            @SerializedName("tags")
            public List<TagsBean> tags;
            @SerializedName("translator")
            public List<?> translator;

            public static class RatingBean implements Parcelable {

                /**
                 * max : 10
                 * numRaters : 744
                 * average : 8.2
                 * min : 0
                 */

                @SerializedName("max")
                public int max;
                @SerializedName("numRaters")
                public int numRaters;
                @SerializedName("average")
                public String average;
                @SerializedName("min")
                public int min;

                @Override
                public int describeContents() {
                    return 0;
                }

                @Override
                public void writeToParcel(Parcel dest, int flags) {
                    dest.writeInt(this.max);
                    dest.writeInt(this.numRaters);
                    dest.writeString(this.average);
                    dest.writeInt(this.min);
                }

                public RatingBean() {
                }

                protected RatingBean(Parcel in) {
                    this.max = in.readInt();
                    this.numRaters = in.readInt();
                    this.average = in.readString();
                    this.min = in.readInt();
                }

                public static final Creator<RatingBean> CREATOR = new Creator<RatingBean>() {
                    @Override
                    public RatingBean createFromParcel(Parcel source) {
                        return new RatingBean(source);
                    }

                    @Override
                    public RatingBean[] newArray(int size) {
                        return new RatingBean[size];
                    }
                };
            }

            public static class ImagesBean implements Parcelable {

                /**
                 * small : https://img3.doubanio.com/spic/s10087844.jpg
                 * large : https://img3.doubanio.com/lpic/s10087844.jpg
                 * medium : https://img3.doubanio.com/mpic/s10087844.jpg
                 */

                @SerializedName("small")
                public String small;
                @SerializedName("large")
                public String large;
                @SerializedName("medium")
                public String medium;

                @Override
                public int describeContents() {
                    return 0;
                }

                @Override
                public void writeToParcel(Parcel dest, int flags) {
                    dest.writeString(this.small);
                    dest.writeString(this.large);
                    dest.writeString(this.medium);
                }

                public ImagesBean() {
                }

                protected ImagesBean(Parcel in) {
                    this.small = in.readString();
                    this.large = in.readString();
                    this.medium = in.readString();
                }

                public static final Creator<ImagesBean> CREATOR = new Creator<ImagesBean>() {
                    @Override
                    public ImagesBean createFromParcel(Parcel source) {
                        return new ImagesBean(source);
                    }

                    @Override
                    public ImagesBean[] newArray(int size) {
                        return new ImagesBean[size];
                    }
                };
            }

            public static class TagsBean implements Parcelable {

                /**
                 * count : 439
                 * name : 历史
                 * title : 历史
                 */

                @SerializedName("count")
                public int count;
                @SerializedName("name")
                public String name;
                @SerializedName("title")
                public String title;

                @Override
                public int describeContents() {
                    return 0;
                }

                @Override
                public void writeToParcel(Parcel dest, int flags) {
                    dest.writeInt(this.count);
                    dest.writeString(this.name);
                    dest.writeString(this.title);
                }

                public TagsBean() {
                }

                protected TagsBean(Parcel in) {
                    this.count = in.readInt();
                    this.name = in.readString();
                    this.title = in.readString();
                }

                public static final Creator<TagsBean> CREATOR = new Creator<TagsBean>() {
                    @Override
                    public TagsBean createFromParcel(Parcel source) {
                        return new TagsBean(source);
                    }

                    @Override
                    public TagsBean[] newArray(int size) {
                        return new TagsBean[size];
                    }
                };
            }

            @Override
            public int describeContents() {
                return 0;
            }

            @Override
            public void writeToParcel(Parcel dest, int flags) {
                dest.writeParcelable(this.rating, flags);
                dest.writeString(this.subtitle);
                dest.writeString(this.pubdate);
                dest.writeString(this.originTitle);
                dest.writeString(this.image);
                dest.writeString(this.binding);
                dest.writeString(this.catalog);
                dest.writeString(this.pages);
                dest.writeParcelable(this.images, flags);
                dest.writeString(this.alt);
                dest.writeString(this.id);
                dest.writeString(this.publisher);
                dest.writeString(this.isbn10);
                dest.writeString(this.isbn13);
                dest.writeString(this.title);
                dest.writeString(this.url);
                dest.writeString(this.altTitle);
                dest.writeString(this.authorIntro);
                dest.writeString(this.summary);
                dest.writeString(this.price);
                dest.writeStringList(this.author);
                dest.writeList(this.tags);
                dest.writeList(this.translator);
            }

            public BookBean() {
            }

            protected BookBean(Parcel in) {
                this.rating = in.readParcelable(RatingBean.class.getClassLoader());
                this.subtitle = in.readString();
                this.pubdate = in.readString();
                this.originTitle = in.readString();
                this.image = in.readString();
                this.binding = in.readString();
                this.catalog = in.readString();
                this.pages = in.readString();
                this.images = in.readParcelable(ImagesBean.class.getClassLoader());
                this.alt = in.readString();
                this.id = in.readString();
                this.publisher = in.readString();
                this.isbn10 = in.readString();
                this.isbn13 = in.readString();
                this.title = in.readString();
                this.url = in.readString();
                this.altTitle = in.readString();
                this.authorIntro = in.readString();
                this.summary = in.readString();
                this.price = in.readString();
                this.author = in.createStringArrayList();
                this.tags = new ArrayList<TagsBean>();
                in.readList(this.tags, TagsBean.class.getClassLoader());
                this.translator = new ArrayList<>();
                in.readList(this.translator, Object.class.getClassLoader());
            }

            public static final Parcelable.Creator<BookBean> CREATOR = new Parcelable.Creator<BookBean>() {
                @Override
                public BookBean createFromParcel(Parcel source) {
                    return new BookBean(source);
                }

                @Override
                public BookBean[] newArray(int size) {
                    return new BookBean[size];
                }
            };
        }

        public static class RatingBeanX implements Parcelable {

            /**
             * max : 5
             * value : 3
             * min : 0
             */

            @SerializedName("max")
            public int max;
            @SerializedName("value")
            public String value;
            @SerializedName("min")
            public int min;

            @Override
            public int describeContents() {
                return 0;
            }

            @Override
            public void writeToParcel(Parcel dest, int flags) {
                dest.writeInt(this.max);
                dest.writeString(this.value);
                dest.writeInt(this.min);
            }

            public RatingBeanX() {
            }

            protected RatingBeanX(Parcel in) {
                this.max = in.readInt();
                this.value = in.readString();
                this.min = in.readInt();
            }

            public static final Parcelable.Creator<RatingBeanX> CREATOR = new Parcelable.Creator<RatingBeanX>() {
                @Override
                public RatingBeanX createFromParcel(Parcel source) {
                    return new RatingBeanX(source);
                }

                @Override
                public RatingBeanX[] newArray(int size) {
                    return new RatingBeanX[size];
                }
            };
        }
    }

    @Override
    public int describeContents() {
        return 0;
    }

    @Override
    public void writeToParcel(Parcel dest, int flags) {
        dest.writeInt(this.count);
        dest.writeInt(this.start);
        dest.writeInt(this.total);
        dest.writeList(this.collections);
    }

    public DBBookCollection() {
    }

    protected DBBookCollection(Parcel in) {
        this.count = in.readInt();
        this.start = in.readInt();
        this.total = in.readInt();
        this.collections = new ArrayList<CollectionsBean>();
        in.readList(this.collections, CollectionsBean.class.getClassLoader());
    }

    public static final Parcelable.Creator<DBBookCollection> CREATOR = new Parcelable.Creator<DBBookCollection>() {
        @Override
        public DBBookCollection createFromParcel(Parcel source) {
            return new DBBookCollection(source);
        }

        @Override
        public DBBookCollection[] newArray(int size) {
            return new DBBookCollection[size];
        }
    };
}
